Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  F4, Redirected Address Base Register */
#define OVC0_BLK19_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FBF4u)

/** Alias (User Manual Name) for OVC0_BLK19_RABR.
 * To use register names with standard convension, please use OVC0_BLK19_RABR.
 */
#define OVC0_RABR19      (OVC0_BLK19_RABR)

/** \\brief  24, Overlay Mask Register */
#define OVC0_BLK1_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FB24u)

/** Alias (User Manual Name) for OVC0_BLK1_OMASK.
 * To use register names with standard convension, please use OVC0_BLK1_OMASK.
 */
#define OVC0_OMASK1      (OVC0_BLK1_OMASK)

/** \\brief  20, Overlay Target Address Register */
#define OVC0_BLK1_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FB20u)

/** Alias (User Manual Name) for OVC0_BLK1_OTAR.
 * To use register names with standard convension, please use OVC0_BLK1_OTAR.
 */
#define OVC0_OTAR1       (OVC0_BLK1_OTAR)

/** \\brief  1C, Redirected Address Base Register */
#define OVC0_BLK1_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FB1Cu)

/** Alias (User Manual Name) for OVC0_BLK1_RABR.
 * To use register names with standard convension, please use OVC0_BLK1_RABR.
 */
#define OVC0_RABR1       (OVC0_BLK1_RABR)

/** \\brief  108, Overlay Mask Register */
#define OVC0_BLK20_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC08u)

/** Alias (User Manual Name) for OVC0_BLK20_OMASK.
 * To use register names with standard convension, please use OVC0_BLK20_OMASK.
 */
#define OVC0_OMASK20     (OVC0_BLK20_OMASK)

/** \\brief  104, Overlay Target Address Register */
#define OVC0_BLK20_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC04u)

/** Alias (User Manual Name) for OVC0_BLK20_OTAR.
 * To use register names with standard convension, please use OVC0_BLK20_OTAR.
 */
#define OVC0_OTAR20      (OVC0_BLK20_OTAR)

/** \\brief  100, Redirected Address Base Register */
#define OVC0_BLK20_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC00u)

/** Alias (User Manual Name) for OVC0_BLK20_RABR.
 * To use register names with standard convension, please use OVC0_BLK20_RABR.
 */
#define OVC0_RABR20      (OVC0_BLK20_RABR)

/** \\brief  114, Overlay Mask Register */
#define OVC0_BLK21_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC14u)

/** Alias (User Manual Name) for OVC0_BLK21_OMASK.
 * To use register names with standard convension, please use OVC0_BLK21_OMASK.
 */
#define OVC0_OMASK21     (OVC0_BLK21_OMASK)

/** \\brief  110, Overlay Target Address Register */
#define OVC0_BLK21_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC10u)

/** Alias (User Manual Name) for OVC0_BLK21_OTAR.
 * To use register names with standard convension, please use OVC0_BLK21_OTAR.
 */
#define OVC0_OTAR21      (OVC0_BLK21_OTAR)

/** \\brief  10C, Redirected Address Base Register */
#define OVC0_BLK21_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC0Cu)

/** Alias (User Manual Name) for OVC0_BLK21_RABR.
 * To use register names with standard convension, please use OVC0_BLK21_RABR.
 */
#define OVC0_RABR21      (OVC0_BLK21_RABR)

/** \\brief  120, Overlay Mask Register */
#define OVC0_BLK22_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC20u)

/** Alias (User Manual Name) for OVC0_BLK22_OMASK.
 * To use register names with standard convension, please use OVC0_BLK22_OMASK.
 */
#define OVC0_OMASK22     (OVC0_BLK22_OMASK)

/** \\brief  11C, Overlay Target Address Register */
#define OVC0_BLK22_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC1Cu)

/** Alias (User Manual Name) for OVC0_BLK22_OTAR.
 * To use register names with standard convension, please use OVC0_BLK22_OTAR.
 */
#define OVC0_OTAR22      (OVC0_BLK22_OTAR)

/** \\brief  118, Redirected Address Base Register */
#define OVC0_BLK22_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC18u)

/** Alias (User Manual Name) for OVC0_BLK22_RABR.
 * To use register names with standard convension, please use OVC0_BLK22_RABR.
 */
#define OVC0_RABR22      (OVC0_BLK22_RABR)

/** \\brief  12C, Overlay Mask Register */
#define OVC0_BLK23_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC2Cu)

/** Alias (User Manual Name) for OVC0_BLK23_OMASK.
 * To use register names with standard convension, please use OVC0_BLK23_OMASK.
 */
#define OVC0_OMASK23     (OVC0_BLK23_OMASK)

/** \\brief  128, Overlay Target Address Register */
#define OVC0_BLK23_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC28u)

/** Alias (User Manual Name) for OVC0_BLK23_OTAR.
 * To use register names with standard convension, please use OVC0_BLK23_OTAR.
 */
#define OVC0_OTAR23      (OVC0_BLK23_OTAR)

/** \\brief  124, Redirected Address Base Register */
#define OVC0_BLK23_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC24u)

/** Alias (User Manual Name) for OVC0_BLK23_RABR.
 * To use register names with standard convension, please use OVC0_BLK23_RABR.
 */
#define OVC0_RABR23      (OVC0_BLK23_RABR)

/** \\brief  138, Overlay Mask Register */
#define OVC0_BLK24_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC38u)

/** Alias (User Manual Name) for OVC0_BLK24_OMASK.
 * To use register names with standard convension, please use OVC0_BLK24_OMASK.
 */
#define OVC0_OMASK24     (OVC0_BLK24_OMASK)

/** \\brief  134, Overlay Target Address Register */
#define OVC0_BLK24_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC34u)

/** Alias (User Manual Name) for OVC0_BLK24_OTAR.
 * To use register names with standard convension, please use OVC0_BLK24_OTAR.
 */
#define OVC0_OTAR24      (OVC0_BLK24_OTAR)

/** \\brief  130, Redirected Address Base Register */
#define OVC0_BLK24_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC30u)

/** Alias (User Manual Name) for OVC0_BLK24_RABR.
 * To use register names with standard convension, please use OVC0_BLK24_RABR.
 */
#define OVC0_RABR24      (OVC0_BLK24_RABR)

/** \\brief  144, Overlay Mask Register */
#define OVC0_BLK25_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC44u)

/** Alias (User Manual Name) for OVC0_BLK25_OMASK.
 * To use register names with standard convension, please use OVC0_BLK25_OMASK.
 */
#define OVC0_OMASK25     (OVC0_BLK25_OMASK)

