Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  140, Overlay Target Address Register */
#define OVC0_BLK25_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC40u)

/** Alias (User Manual Name) for OVC0_BLK25_OTAR.
 * To use register names with standard convension, please use OVC0_BLK25_OTAR.
 */
#define OVC0_OTAR25      (OVC0_BLK25_OTAR)

/** \\brief  13C, Redirected Address Base Register */
#define OVC0_BLK25_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC3Cu)

/** Alias (User Manual Name) for OVC0_BLK25_RABR.
 * To use register names with standard convension, please use OVC0_BLK25_RABR.
 */
#define OVC0_RABR25      (OVC0_BLK25_RABR)

/** \\brief  150, Overlay Mask Register */
#define OVC0_BLK26_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC50u)

/** Alias (User Manual Name) for OVC0_BLK26_OMASK.
 * To use register names with standard convension, please use OVC0_BLK26_OMASK.
 */
#define OVC0_OMASK26     (OVC0_BLK26_OMASK)

/** \\brief  14C, Overlay Target Address Register */
#define OVC0_BLK26_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC4Cu)

/** Alias (User Manual Name) for OVC0_BLK26_OTAR.
 * To use register names with standard convension, please use OVC0_BLK26_OTAR.
 */
#define OVC0_OTAR26      (OVC0_BLK26_OTAR)

/** \\brief  148, Redirected Address Base Register */
#define OVC0_BLK26_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC48u)

/** Alias (User Manual Name) for OVC0_BLK26_RABR.
 * To use register names with standard convension, please use OVC0_BLK26_RABR.
 */
#define OVC0_RABR26      (OVC0_BLK26_RABR)

/** \\brief  15C, Overlay Mask Register */
#define OVC0_BLK27_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC5Cu)

/** Alias (User Manual Name) for OVC0_BLK27_OMASK.
 * To use register names with standard convension, please use OVC0_BLK27_OMASK.
 */
#define OVC0_OMASK27     (OVC0_BLK27_OMASK)

/** \\brief  158, Overlay Target Address Register */
#define OVC0_BLK27_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC58u)

/** Alias (User Manual Name) for OVC0_BLK27_OTAR.
 * To use register names with standard convension, please use OVC0_BLK27_OTAR.
 */
#define OVC0_OTAR27      (OVC0_BLK27_OTAR)

/** \\brief  154, Redirected Address Base Register */
#define OVC0_BLK27_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC54u)

/** Alias (User Manual Name) for OVC0_BLK27_RABR.
 * To use register names with standard convension, please use OVC0_BLK27_RABR.
 */
#define OVC0_RABR27      (OVC0_BLK27_RABR)

/** \\brief  168, Overlay Mask Register */
#define OVC0_BLK28_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC68u)

/** Alias (User Manual Name) for OVC0_BLK28_OMASK.
 * To use register names with standard convension, please use OVC0_BLK28_OMASK.
 */
#define OVC0_OMASK28     (OVC0_BLK28_OMASK)

/** \\brief  164, Overlay Target Address Register */
#define OVC0_BLK28_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC64u)

/** Alias (User Manual Name) for OVC0_BLK28_OTAR.
 * To use register names with standard convension, please use OVC0_BLK28_OTAR.
 */
#define OVC0_OTAR28      (OVC0_BLK28_OTAR)

/** \\brief  160, Redirected Address Base Register */
#define OVC0_BLK28_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC60u)

/** Alias (User Manual Name) for OVC0_BLK28_RABR.
 * To use register names with standard convension, please use OVC0_BLK28_RABR.
 */
#define OVC0_RABR28      (OVC0_BLK28_RABR)

/** \\brief  174, Overlay Mask Register */
#define OVC0_BLK29_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC74u)

/** Alias (User Manual Name) for OVC0_BLK29_OMASK.
 * To use register names with standard convension, please use OVC0_BLK29_OMASK.
 */
#define OVC0_OMASK29     (OVC0_BLK29_OMASK)

/** \\brief  170, Overlay Target Address Register */
#define OVC0_BLK29_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC70u)

/** Alias (User Manual Name) for OVC0_BLK29_OTAR.
 * To use register names with standard convension, please use OVC0_BLK29_OTAR.
 */
#define OVC0_OTAR29      (OVC0_BLK29_OTAR)

/** \\brief  16C, Redirected Address Base Register */
#define OVC0_BLK29_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC6Cu)

/** Alias (User Manual Name) for OVC0_BLK29_RABR.
 * To use register names with standard convension, please use OVC0_BLK29_RABR.
 */
#define OVC0_RABR29      (OVC0_BLK29_RABR)

/** \\brief  30, Overlay Mask Register */
#define OVC0_BLK2_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FB30u)

/** Alias (User Manual Name) for OVC0_BLK2_OMASK.
 * To use register names with standard convension, please use OVC0_BLK2_OMASK.
 */
#define OVC0_OMASK2      (OVC0_BLK2_OMASK)

/** \\brief  2C, Overlay Target Address Register */
#define OVC0_BLK2_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FB2Cu)

/** Alias (User Manual Name) for OVC0_BLK2_OTAR.
 * To use register names with standard convension, please use OVC0_BLK2_OTAR.
 */
#define OVC0_OTAR2       (OVC0_BLK2_OTAR)

/** \\brief  28, Redirected Address Base Register */
#define OVC0_BLK2_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FB28u)

/** Alias (User Manual Name) for OVC0_BLK2_RABR.
 * To use register names with standard convension, please use OVC0_BLK2_RABR.
 */
#define OVC0_RABR2       (OVC0_BLK2_RABR)

/** \\brief  180, Overlay Mask Register */
#define OVC0_BLK30_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC80u)

/** Alias (User Manual Name) for OVC0_BLK30_OMASK.
 * To use register names with standard convension, please use OVC0_BLK30_OMASK.
 */
#define OVC0_OMASK30     (OVC0_BLK30_OMASK)

/** \\brief  17C, Overlay Target Address Register */
#define OVC0_BLK30_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC7Cu)

/** Alias (User Manual Name) for OVC0_BLK30_OTAR.
 * To use register names with standard convension, please use OVC0_BLK30_OTAR.
 */
#define OVC0_OTAR30      (OVC0_BLK30_OTAR)

/** \\brief  178, Redirected Address Base Register */
#define OVC0_BLK30_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC78u)

