Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC0_BLK30_RABR.
 * To use register names with standard convension, please use OVC0_BLK30_RABR.
 */
#define OVC0_RABR30      (OVC0_BLK30_RABR)

/** \\brief  18C, Overlay Mask Register */
#define OVC0_BLK31_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FC8Cu)

/** Alias (User Manual Name) for OVC0_BLK31_OMASK.
 * To use register names with standard convension, please use OVC0_BLK31_OMASK.
 */
#define OVC0_OMASK31     (OVC0_BLK31_OMASK)

/** \\brief  188, Overlay Target Address Register */
#define OVC0_BLK31_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FC88u)

/** Alias (User Manual Name) for OVC0_BLK31_OTAR.
 * To use register names with standard convension, please use OVC0_BLK31_OTAR.
 */
#define OVC0_OTAR31      (OVC0_BLK31_OTAR)

/** \\brief  184, Redirected Address Base Register */
#define OVC0_BLK31_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FC84u)

/** Alias (User Manual Name) for OVC0_BLK31_RABR.
 * To use register names with standard convension, please use OVC0_BLK31_RABR.
 */
#define OVC0_RABR31      (OVC0_BLK31_RABR)

/** \\brief  3C, Overlay Mask Register */
#define OVC0_BLK3_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FB3Cu)

/** Alias (User Manual Name) for OVC0_BLK3_OMASK.
 * To use register names with standard convension, please use OVC0_BLK3_OMASK.
 */
#define OVC0_OMASK3      (OVC0_BLK3_OMASK)

/** \\brief  38, Overlay Target Address Register */
#define OVC0_BLK3_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FB38u)

/** Alias (User Manual Name) for OVC0_BLK3_OTAR.
 * To use register names with standard convension, please use OVC0_BLK3_OTAR.
 */
#define OVC0_OTAR3       (OVC0_BLK3_OTAR)

/** \\brief  34, Redirected Address Base Register */
#define OVC0_BLK3_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FB34u)

/** Alias (User Manual Name) for OVC0_BLK3_RABR.
 * To use register names with standard convension, please use OVC0_BLK3_RABR.
 */
#define OVC0_RABR3       (OVC0_BLK3_RABR)

/** \\brief  48, Overlay Mask Register */
#define OVC0_BLK4_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FB48u)

/** Alias (User Manual Name) for OVC0_BLK4_OMASK.
 * To use register names with standard convension, please use OVC0_BLK4_OMASK.
 */
#define OVC0_OMASK4      (OVC0_BLK4_OMASK)

/** \\brief  44, Overlay Target Address Register */
#define OVC0_BLK4_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FB44u)

/** Alias (User Manual Name) for OVC0_BLK4_OTAR.
 * To use register names with standard convension, please use OVC0_BLK4_OTAR.
 */
#define OVC0_OTAR4       (OVC0_BLK4_OTAR)

/** \\brief  40, Redirected Address Base Register */
#define OVC0_BLK4_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FB40u)

/** Alias (User Manual Name) for OVC0_BLK4_RABR.
 * To use register names with standard convension, please use OVC0_BLK4_RABR.
 */
#define OVC0_RABR4       (OVC0_BLK4_RABR)

/** \\brief  54, Overlay Mask Register */
#define OVC0_BLK5_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FB54u)

/** Alias (User Manual Name) for OVC0_BLK5_OMASK.
 * To use register names with standard convension, please use OVC0_BLK5_OMASK.
 */
#define OVC0_OMASK5      (OVC0_BLK5_OMASK)

/** \\brief  50, Overlay Target Address Register */
#define OVC0_BLK5_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FB50u)

/** Alias (User Manual Name) for OVC0_BLK5_OTAR.
 * To use register names with standard convension, please use OVC0_BLK5_OTAR.
 */
#define OVC0_OTAR5       (OVC0_BLK5_OTAR)

/** \\brief  4C, Redirected Address Base Register */
#define OVC0_BLK5_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FB4Cu)

/** Alias (User Manual Name) for OVC0_BLK5_RABR.
 * To use register names with standard convension, please use OVC0_BLK5_RABR.
 */
#define OVC0_RABR5       (OVC0_BLK5_RABR)

/** \\brief  60, Overlay Mask Register */
#define OVC0_BLK6_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FB60u)

/** Alias (User Manual Name) for OVC0_BLK6_OMASK.
 * To use register names with standard convension, please use OVC0_BLK6_OMASK.
 */
#define OVC0_OMASK6      (OVC0_BLK6_OMASK)

/** \\brief  5C, Overlay Target Address Register */
#define OVC0_BLK6_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FB5Cu)

/** Alias (User Manual Name) for OVC0_BLK6_OTAR.
 * To use register names with standard convension, please use OVC0_BLK6_OTAR.
 */
#define OVC0_OTAR6       (OVC0_BLK6_OTAR)

/** \\brief  58, Redirected Address Base Register */
#define OVC0_BLK6_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FB58u)

/** Alias (User Manual Name) for OVC0_BLK6_RABR.
 * To use register names with standard convension, please use OVC0_BLK6_RABR.
 */
#define OVC0_RABR6       (OVC0_BLK6_RABR)

/** \\brief  6C, Overlay Mask Register */
#define OVC0_BLK7_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FB6Cu)

/** Alias (User Manual Name) for OVC0_BLK7_OMASK.
 * To use register names with standard convension, please use OVC0_BLK7_OMASK.
 */
#define OVC0_OMASK7      (OVC0_BLK7_OMASK)

/** \\brief  68, Overlay Target Address Register */
#define OVC0_BLK7_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FB68u)

/** Alias (User Manual Name) for OVC0_BLK7_OTAR.
 * To use register names with standard convension, please use OVC0_BLK7_OTAR.
 */
#define OVC0_OTAR7       (OVC0_BLK7_OTAR)

/** \\brief  64, Redirected Address Base Register */
#define OVC0_BLK7_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FB64u)

/** Alias (User Manual Name) for OVC0_BLK7_RABR.
 * To use register names with standard convension, please use OVC0_BLK7_RABR.
 */
#define OVC0_RABR7       (OVC0_BLK7_RABR)

/** \\brief  78, Overlay Mask Register */
#define OVC0_BLK8_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FB78u)

/** Alias (User Manual Name) for OVC0_BLK8_OMASK.
 * To use register names with standard convension, please use OVC0_BLK8_OMASK.
 */
#define OVC0_OMASK8      (OVC0_BLK8_OMASK)

/** \\brief  74, Overlay Target Address Register */
#define OVC0_BLK8_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FB74u)

/** Alias (User Manual Name) for OVC0_BLK8_OTAR.
 * To use register names with standard convension, please use OVC0_BLK8_OTAR.
 */
#define OVC0_OTAR8       (OVC0_BLK8_OTAR)

