Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  70, Redirected Address Base Register */
#define OVC0_BLK8_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FB70u)

/** Alias (User Manual Name) for OVC0_BLK8_RABR.
 * To use register names with standard convension, please use OVC0_BLK8_RABR.
 */
#define OVC0_RABR8       (OVC0_BLK8_RABR)

/** \\brief  84, Overlay Mask Register */
#define OVC0_BLK9_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF880FB84u)

/** Alias (User Manual Name) for OVC0_BLK9_OMASK.
 * To use register names with standard convension, please use OVC0_BLK9_OMASK.
 */
#define OVC0_OMASK9      (OVC0_BLK9_OMASK)

/** \\brief  80, Overlay Target Address Register */
#define OVC0_BLK9_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF880FB80u)

/** Alias (User Manual Name) for OVC0_BLK9_OTAR.
 * To use register names with standard convension, please use OVC0_BLK9_OTAR.
 */
#define OVC0_OTAR9       (OVC0_BLK9_OTAR)

/** \\brief  7C, Redirected Address Base Register */
#define OVC0_BLK9_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF880FB7Cu)

/** Alias (User Manual Name) for OVC0_BLK9_RABR.
 * To use register names with standard convension, please use OVC0_BLK9_RABR.
 */
#define OVC0_RABR9       (OVC0_BLK9_RABR)

/** \\brief  0, Overlay Range Select Register */
#define OVC0_OSEL        /*lint --e(923)*/ (*(volatile Ifx_OVC_OSEL *)0xF880FB00u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ovc_Cfg_Ovc1
 * \{  */

/** \\brief  18, Overlay Mask Register */
#define OVC1_BLK0_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FB18u)

/** Alias (User Manual Name) for OVC1_BLK0_OMASK.
 * To use register names with standard convension, please use OVC1_BLK0_OMASK.
 */
#define OVC1_OMASK0      (OVC1_BLK0_OMASK)

/** \\brief  14, Overlay Target Address Register */
#define OVC1_BLK0_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FB14u)

/** Alias (User Manual Name) for OVC1_BLK0_OTAR.
 * To use register names with standard convension, please use OVC1_BLK0_OTAR.
 */
#define OVC1_OTAR0       (OVC1_BLK0_OTAR)

/** \\brief  10, Redirected Address Base Register */
#define OVC1_BLK0_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FB10u)

/** Alias (User Manual Name) for OVC1_BLK0_RABR.
 * To use register names with standard convension, please use OVC1_BLK0_RABR.
 */
#define OVC1_RABR0       (OVC1_BLK0_RABR)

/** \\brief  90, Overlay Mask Register */
#define OVC1_BLK10_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FB90u)

/** Alias (User Manual Name) for OVC1_BLK10_OMASK.
 * To use register names with standard convension, please use OVC1_BLK10_OMASK.
 */
#define OVC1_OMASK10     (OVC1_BLK10_OMASK)

/** \\brief  8C, Overlay Target Address Register */
#define OVC1_BLK10_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FB8Cu)

/** Alias (User Manual Name) for OVC1_BLK10_OTAR.
 * To use register names with standard convension, please use OVC1_BLK10_OTAR.
 */
#define OVC1_OTAR10      (OVC1_BLK10_OTAR)

/** \\brief  88, Redirected Address Base Register */
#define OVC1_BLK10_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FB88u)

/** Alias (User Manual Name) for OVC1_BLK10_RABR.
 * To use register names with standard convension, please use OVC1_BLK10_RABR.
 */
#define OVC1_RABR10      (OVC1_BLK10_RABR)

/** \\brief  9C, Overlay Mask Register */
#define OVC1_BLK11_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FB9Cu)

/** Alias (User Manual Name) for OVC1_BLK11_OMASK.
 * To use register names with standard convension, please use OVC1_BLK11_OMASK.
 */
#define OVC1_OMASK11     (OVC1_BLK11_OMASK)

/** \\brief  98, Overlay Target Address Register */
#define OVC1_BLK11_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FB98u)

/** Alias (User Manual Name) for OVC1_BLK11_OTAR.
 * To use register names with standard convension, please use OVC1_BLK11_OTAR.
 */
#define OVC1_OTAR11      (OVC1_BLK11_OTAR)

/** \\brief  94, Redirected Address Base Register */
#define OVC1_BLK11_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FB94u)

/** Alias (User Manual Name) for OVC1_BLK11_RABR.
 * To use register names with standard convension, please use OVC1_BLK11_RABR.
 */
#define OVC1_RABR11      (OVC1_BLK11_RABR)

/** \\brief  A8, Overlay Mask Register */
#define OVC1_BLK12_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FBA8u)

/** Alias (User Manual Name) for OVC1_BLK12_OMASK.
 * To use register names with standard convension, please use OVC1_BLK12_OMASK.
 */
#define OVC1_OMASK12     (OVC1_BLK12_OMASK)

/** \\brief  A4, Overlay Target Address Register */
#define OVC1_BLK12_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FBA4u)

/** Alias (User Manual Name) for OVC1_BLK12_OTAR.
 * To use register names with standard convension, please use OVC1_BLK12_OTAR.
 */
#define OVC1_OTAR12      (OVC1_BLK12_OTAR)

/** \\brief  A0, Redirected Address Base Register */
#define OVC1_BLK12_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FBA0u)

/** Alias (User Manual Name) for OVC1_BLK12_RABR.
 * To use register names with standard convension, please use OVC1_BLK12_RABR.
 */
#define OVC1_RABR12      (OVC1_BLK12_RABR)

/** \\brief  B4, Overlay Mask Register */
#define OVC1_BLK13_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FBB4u)

/** Alias (User Manual Name) for OVC1_BLK13_OMASK.
 * To use register names with standard convension, please use OVC1_BLK13_OMASK.
 */
#define OVC1_OMASK13     (OVC1_BLK13_OMASK)

/** \\brief  B0, Overlay Target Address Register */
#define OVC1_BLK13_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FBB0u)

/** Alias (User Manual Name) for OVC1_BLK13_OTAR.
 * To use register names with standard convension, please use OVC1_BLK13_OTAR.
 */
#define OVC1_OTAR13      (OVC1_BLK13_OTAR)

/** \\brief  AC, Redirected Address Base Register */
#define OVC1_BLK13_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FBACu)

/** Alias (User Manual Name) for OVC1_BLK13_RABR.
 * To use register names with standard convension, please use OVC1_BLK13_RABR.
 */
#define OVC1_RABR13      (OVC1_BLK13_RABR)

