Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  C0, Overlay Mask Register */
#define OVC1_BLK14_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FBC0u)

/** Alias (User Manual Name) for OVC1_BLK14_OMASK.
 * To use register names with standard convension, please use OVC1_BLK14_OMASK.
 */
#define OVC1_OMASK14     (OVC1_BLK14_OMASK)

/** \\brief  BC, Overlay Target Address Register */
#define OVC1_BLK14_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FBBCu)

/** Alias (User Manual Name) for OVC1_BLK14_OTAR.
 * To use register names with standard convension, please use OVC1_BLK14_OTAR.
 */
#define OVC1_OTAR14      (OVC1_BLK14_OTAR)

/** \\brief  B8, Redirected Address Base Register */
#define OVC1_BLK14_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FBB8u)

/** Alias (User Manual Name) for OVC1_BLK14_RABR.
 * To use register names with standard convension, please use OVC1_BLK14_RABR.
 */
#define OVC1_RABR14      (OVC1_BLK14_RABR)

/** \\brief  CC, Overlay Mask Register */
#define OVC1_BLK15_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FBCCu)

/** Alias (User Manual Name) for OVC1_BLK15_OMASK.
 * To use register names with standard convension, please use OVC1_BLK15_OMASK.
 */
#define OVC1_OMASK15     (OVC1_BLK15_OMASK)

/** \\brief  C8, Overlay Target Address Register */
#define OVC1_BLK15_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FBC8u)

/** Alias (User Manual Name) for OVC1_BLK15_OTAR.
 * To use register names with standard convension, please use OVC1_BLK15_OTAR.
 */
#define OVC1_OTAR15      (OVC1_BLK15_OTAR)

/** \\brief  C4, Redirected Address Base Register */
#define OVC1_BLK15_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FBC4u)

/** Alias (User Manual Name) for OVC1_BLK15_RABR.
 * To use register names with standard convension, please use OVC1_BLK15_RABR.
 */
#define OVC1_RABR15      (OVC1_BLK15_RABR)

/** \\brief  D8, Overlay Mask Register */
#define OVC1_BLK16_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FBD8u)

/** Alias (User Manual Name) for OVC1_BLK16_OMASK.
 * To use register names with standard convension, please use OVC1_BLK16_OMASK.
 */
#define OVC1_OMASK16     (OVC1_BLK16_OMASK)

/** \\brief  D4, Overlay Target Address Register */
#define OVC1_BLK16_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FBD4u)

/** Alias (User Manual Name) for OVC1_BLK16_OTAR.
 * To use register names with standard convension, please use OVC1_BLK16_OTAR.
 */
#define OVC1_OTAR16      (OVC1_BLK16_OTAR)

/** \\brief  D0, Redirected Address Base Register */
#define OVC1_BLK16_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FBD0u)

/** Alias (User Manual Name) for OVC1_BLK16_RABR.
 * To use register names with standard convension, please use OVC1_BLK16_RABR.
 */
#define OVC1_RABR16      (OVC1_BLK16_RABR)

/** \\brief  E4, Overlay Mask Register */
#define OVC1_BLK17_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FBE4u)

/** Alias (User Manual Name) for OVC1_BLK17_OMASK.
 * To use register names with standard convension, please use OVC1_BLK17_OMASK.
 */
#define OVC1_OMASK17     (OVC1_BLK17_OMASK)

/** \\brief  E0, Overlay Target Address Register */
#define OVC1_BLK17_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FBE0u)

/** Alias (User Manual Name) for OVC1_BLK17_OTAR.
 * To use register names with standard convension, please use OVC1_BLK17_OTAR.
 */
#define OVC1_OTAR17      (OVC1_BLK17_OTAR)

/** \\brief  DC, Redirected Address Base Register */
#define OVC1_BLK17_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FBDCu)

/** Alias (User Manual Name) for OVC1_BLK17_RABR.
 * To use register names with standard convension, please use OVC1_BLK17_RABR.
 */
#define OVC1_RABR17      (OVC1_BLK17_RABR)

/** \\brief  F0, Overlay Mask Register */
#define OVC1_BLK18_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FBF0u)

/** Alias (User Manual Name) for OVC1_BLK18_OMASK.
 * To use register names with standard convension, please use OVC1_BLK18_OMASK.
 */
#define OVC1_OMASK18     (OVC1_BLK18_OMASK)

/** \\brief  EC, Overlay Target Address Register */
#define OVC1_BLK18_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FBECu)

/** Alias (User Manual Name) for OVC1_BLK18_OTAR.
 * To use register names with standard convension, please use OVC1_BLK18_OTAR.
 */
#define OVC1_OTAR18      (OVC1_BLK18_OTAR)

/** \\brief  E8, Redirected Address Base Register */
#define OVC1_BLK18_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FBE8u)

/** Alias (User Manual Name) for OVC1_BLK18_RABR.
 * To use register names with standard convension, please use OVC1_BLK18_RABR.
 */
#define OVC1_RABR18      (OVC1_BLK18_RABR)

/** \\brief  FC, Overlay Mask Register */
#define OVC1_BLK19_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FBFCu)

/** Alias (User Manual Name) for OVC1_BLK19_OMASK.
 * To use register names with standard convension, please use OVC1_BLK19_OMASK.
 */
#define OVC1_OMASK19     (OVC1_BLK19_OMASK)

/** \\brief  F8, Overlay Target Address Register */
#define OVC1_BLK19_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FBF8u)

/** Alias (User Manual Name) for OVC1_BLK19_OTAR.
 * To use register names with standard convension, please use OVC1_BLK19_OTAR.
 */
#define OVC1_OTAR19      (OVC1_BLK19_OTAR)

/** \\brief  F4, Redirected Address Base Register */
#define OVC1_BLK19_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FBF4u)

/** Alias (User Manual Name) for OVC1_BLK19_RABR.
 * To use register names with standard convension, please use OVC1_BLK19_RABR.
 */
#define OVC1_RABR19      (OVC1_BLK19_RABR)

/** \\brief  24, Overlay Mask Register */
#define OVC1_BLK1_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FB24u)

/** Alias (User Manual Name) for OVC1_BLK1_OMASK.
 * To use register names with standard convension, please use OVC1_BLK1_OMASK.
 */
#define OVC1_OMASK1      (OVC1_BLK1_OMASK)

/** \\brief  20, Overlay Target Address Register */
#define OVC1_BLK1_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FB20u)

/** Alias (User Manual Name) for OVC1_BLK1_OTAR.
 * To use register names with standard convension, please use OVC1_BLK1_OTAR.
 */
#define OVC1_OTAR1       (OVC1_BLK1_OTAR)

/** \\brief  1C, Redirected Address Base Register */
#define OVC1_BLK1_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FB1Cu)

/** Alias (User Manual Name) for OVC1_BLK1_RABR.
 * To use register names with standard convension, please use OVC1_BLK1_RABR.
 */
#define OVC1_RABR1       (OVC1_BLK1_RABR)

/** \\brief  108, Overlay Mask Register */
#define OVC1_BLK20_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FC08u)

