Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC1_BLK20_OMASK.
 * To use register names with standard convension, please use OVC1_BLK20_OMASK.
 */
#define OVC1_OMASK20     (OVC1_BLK20_OMASK)

/** \\brief  104, Overlay Target Address Register */
#define OVC1_BLK20_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FC04u)

/** Alias (User Manual Name) for OVC1_BLK20_OTAR.
 * To use register names with standard convension, please use OVC1_BLK20_OTAR.
 */
#define OVC1_OTAR20      (OVC1_BLK20_OTAR)

/** \\brief  100, Redirected Address Base Register */
#define OVC1_BLK20_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FC00u)

/** Alias (User Manual Name) for OVC1_BLK20_RABR.
 * To use register names with standard convension, please use OVC1_BLK20_RABR.
 */
#define OVC1_RABR20      (OVC1_BLK20_RABR)

/** \\brief  114, Overlay Mask Register */
#define OVC1_BLK21_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FC14u)

/** Alias (User Manual Name) for OVC1_BLK21_OMASK.
 * To use register names with standard convension, please use OVC1_BLK21_OMASK.
 */
#define OVC1_OMASK21     (OVC1_BLK21_OMASK)

/** \\brief  110, Overlay Target Address Register */
#define OVC1_BLK21_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FC10u)

/** Alias (User Manual Name) for OVC1_BLK21_OTAR.
 * To use register names with standard convension, please use OVC1_BLK21_OTAR.
 */
#define OVC1_OTAR21      (OVC1_BLK21_OTAR)

/** \\brief  10C, Redirected Address Base Register */
#define OVC1_BLK21_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FC0Cu)

/** Alias (User Manual Name) for OVC1_BLK21_RABR.
 * To use register names with standard convension, please use OVC1_BLK21_RABR.
 */
#define OVC1_RABR21      (OVC1_BLK21_RABR)

/** \\brief  120, Overlay Mask Register */
#define OVC1_BLK22_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FC20u)

/** Alias (User Manual Name) for OVC1_BLK22_OMASK.
 * To use register names with standard convension, please use OVC1_BLK22_OMASK.
 */
#define OVC1_OMASK22     (OVC1_BLK22_OMASK)

/** \\brief  11C, Overlay Target Address Register */
#define OVC1_BLK22_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FC1Cu)

/** Alias (User Manual Name) for OVC1_BLK22_OTAR.
 * To use register names with standard convension, please use OVC1_BLK22_OTAR.
 */
#define OVC1_OTAR22      (OVC1_BLK22_OTAR)

/** \\brief  118, Redirected Address Base Register */
#define OVC1_BLK22_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FC18u)

/** Alias (User Manual Name) for OVC1_BLK22_RABR.
 * To use register names with standard convension, please use OVC1_BLK22_RABR.
 */
#define OVC1_RABR22      (OVC1_BLK22_RABR)

/** \\brief  12C, Overlay Mask Register */
#define OVC1_BLK23_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FC2Cu)

/** Alias (User Manual Name) for OVC1_BLK23_OMASK.
 * To use register names with standard convension, please use OVC1_BLK23_OMASK.
 */
#define OVC1_OMASK23     (OVC1_BLK23_OMASK)

/** \\brief  128, Overlay Target Address Register */
#define OVC1_BLK23_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FC28u)

/** Alias (User Manual Name) for OVC1_BLK23_OTAR.
 * To use register names with standard convension, please use OVC1_BLK23_OTAR.
 */
#define OVC1_OTAR23      (OVC1_BLK23_OTAR)

/** \\brief  124, Redirected Address Base Register */
#define OVC1_BLK23_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FC24u)

/** Alias (User Manual Name) for OVC1_BLK23_RABR.
 * To use register names with standard convension, please use OVC1_BLK23_RABR.
 */
#define OVC1_RABR23      (OVC1_BLK23_RABR)

/** \\brief  138, Overlay Mask Register */
#define OVC1_BLK24_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FC38u)

/** Alias (User Manual Name) for OVC1_BLK24_OMASK.
 * To use register names with standard convension, please use OVC1_BLK24_OMASK.
 */
#define OVC1_OMASK24     (OVC1_BLK24_OMASK)

/** \\brief  134, Overlay Target Address Register */
#define OVC1_BLK24_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FC34u)

/** Alias (User Manual Name) for OVC1_BLK24_OTAR.
 * To use register names with standard convension, please use OVC1_BLK24_OTAR.
 */
#define OVC1_OTAR24      (OVC1_BLK24_OTAR)

/** \\brief  130, Redirected Address Base Register */
#define OVC1_BLK24_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FC30u)

/** Alias (User Manual Name) for OVC1_BLK24_RABR.
 * To use register names with standard convension, please use OVC1_BLK24_RABR.
 */
#define OVC1_RABR24      (OVC1_BLK24_RABR)

/** \\brief  144, Overlay Mask Register */
#define OVC1_BLK25_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FC44u)

/** Alias (User Manual Name) for OVC1_BLK25_OMASK.
 * To use register names with standard convension, please use OVC1_BLK25_OMASK.
 */
#define OVC1_OMASK25     (OVC1_BLK25_OMASK)

/** \\brief  140, Overlay Target Address Register */
#define OVC1_BLK25_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FC40u)

/** Alias (User Manual Name) for OVC1_BLK25_OTAR.
 * To use register names with standard convension, please use OVC1_BLK25_OTAR.
 */
#define OVC1_OTAR25      (OVC1_BLK25_OTAR)

/** \\brief  13C, Redirected Address Base Register */
#define OVC1_BLK25_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FC3Cu)

/** Alias (User Manual Name) for OVC1_BLK25_RABR.
 * To use register names with standard convension, please use OVC1_BLK25_RABR.
 */
#define OVC1_RABR25      (OVC1_BLK25_RABR)

/** \\brief  150, Overlay Mask Register */
#define OVC1_BLK26_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF882FC50u)

/** Alias (User Manual Name) for OVC1_BLK26_OMASK.
 * To use register names with standard convension, please use OVC1_BLK26_OMASK.
 */
#define OVC1_OMASK26     (OVC1_BLK26_OMASK)

/** \\brief  14C, Overlay Target Address Register */
#define OVC1_BLK26_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF882FC4Cu)

/** Alias (User Manual Name) for OVC1_BLK26_OTAR.
 * To use register names with standard convension, please use OVC1_BLK26_OTAR.
 */
#define OVC1_OTAR26      (OVC1_BLK26_OTAR)

/** \\brief  148, Redirected Address Base Register */
#define OVC1_BLK26_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF882FC48u)

/** Alias (User Manual Name) for OVC1_BLK26_RABR.
 * To use register names with standard convension, please use OVC1_BLK26_RABR.
 */
#define OVC1_RABR26      (OVC1_BLK26_RABR)

