Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  0, Overlay Range Select Register */
#define OVC1_OSEL        /*lint --e(923)*/ (*(volatile Ifx_OVC_OSEL *)0xF882FB00u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ovc_Cfg_Ovc2
 * \{  */

/** \\brief  18, Overlay Mask Register */
#define OVC2_BLK0_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FB18u)

/** Alias (User Manual Name) for OVC2_BLK0_OMASK.
 * To use register names with standard convension, please use OVC2_BLK0_OMASK.
 */
#define OVC2_OMASK0      (OVC2_BLK0_OMASK)

/** \\brief  14, Overlay Target Address Register */
#define OVC2_BLK0_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FB14u)

/** Alias (User Manual Name) for OVC2_BLK0_OTAR.
 * To use register names with standard convension, please use OVC2_BLK0_OTAR.
 */
#define OVC2_OTAR0       (OVC2_BLK0_OTAR)

/** \\brief  10, Redirected Address Base Register */
#define OVC2_BLK0_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FB10u)

/** Alias (User Manual Name) for OVC2_BLK0_RABR.
 * To use register names with standard convension, please use OVC2_BLK0_RABR.
 */
#define OVC2_RABR0       (OVC2_BLK0_RABR)

/** \\brief  90, Overlay Mask Register */
#define OVC2_BLK10_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FB90u)

/** Alias (User Manual Name) for OVC2_BLK10_OMASK.
 * To use register names with standard convension, please use OVC2_BLK10_OMASK.
 */
#define OVC2_OMASK10     (OVC2_BLK10_OMASK)

/** \\brief  8C, Overlay Target Address Register */
#define OVC2_BLK10_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FB8Cu)

/** Alias (User Manual Name) for OVC2_BLK10_OTAR.
 * To use register names with standard convension, please use OVC2_BLK10_OTAR.
 */
#define OVC2_OTAR10      (OVC2_BLK10_OTAR)

/** \\brief  88, Redirected Address Base Register */
#define OVC2_BLK10_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FB88u)

/** Alias (User Manual Name) for OVC2_BLK10_RABR.
 * To use register names with standard convension, please use OVC2_BLK10_RABR.
 */
#define OVC2_RABR10      (OVC2_BLK10_RABR)

/** \\brief  9C, Overlay Mask Register */
#define OVC2_BLK11_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FB9Cu)

/** Alias (User Manual Name) for OVC2_BLK11_OMASK.
 * To use register names with standard convension, please use OVC2_BLK11_OMASK.
 */
#define OVC2_OMASK11     (OVC2_BLK11_OMASK)

/** \\brief  98, Overlay Target Address Register */
#define OVC2_BLK11_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FB98u)

/** Alias (User Manual Name) for OVC2_BLK11_OTAR.
 * To use register names with standard convension, please use OVC2_BLK11_OTAR.
 */
#define OVC2_OTAR11      (OVC2_BLK11_OTAR)

/** \\brief  94, Redirected Address Base Register */
#define OVC2_BLK11_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FB94u)

/** Alias (User Manual Name) for OVC2_BLK11_RABR.
 * To use register names with standard convension, please use OVC2_BLK11_RABR.
 */
#define OVC2_RABR11      (OVC2_BLK11_RABR)

/** \\brief  A8, Overlay Mask Register */
#define OVC2_BLK12_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FBA8u)

/** Alias (User Manual Name) for OVC2_BLK12_OMASK.
 * To use register names with standard convension, please use OVC2_BLK12_OMASK.
 */
#define OVC2_OMASK12     (OVC2_BLK12_OMASK)

/** \\brief  A4, Overlay Target Address Register */
#define OVC2_BLK12_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FBA4u)

/** Alias (User Manual Name) for OVC2_BLK12_OTAR.
 * To use register names with standard convension, please use OVC2_BLK12_OTAR.
 */
#define OVC2_OTAR12      (OVC2_BLK12_OTAR)

/** \\brief  A0, Redirected Address Base Register */
#define OVC2_BLK12_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FBA0u)

/** Alias (User Manual Name) for OVC2_BLK12_RABR.
 * To use register names with standard convension, please use OVC2_BLK12_RABR.
 */
#define OVC2_RABR12      (OVC2_BLK12_RABR)

/** \\brief  B4, Overlay Mask Register */
#define OVC2_BLK13_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FBB4u)

/** Alias (User Manual Name) for OVC2_BLK13_OMASK.
 * To use register names with standard convension, please use OVC2_BLK13_OMASK.
 */
#define OVC2_OMASK13     (OVC2_BLK13_OMASK)

/** \\brief  B0, Overlay Target Address Register */
#define OVC2_BLK13_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FBB0u)

/** Alias (User Manual Name) for OVC2_BLK13_OTAR.
 * To use register names with standard convension, please use OVC2_BLK13_OTAR.
 */
#define OVC2_OTAR13      (OVC2_BLK13_OTAR)

/** \\brief  AC, Redirected Address Base Register */
#define OVC2_BLK13_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FBACu)

/** Alias (User Manual Name) for OVC2_BLK13_RABR.
 * To use register names with standard convension, please use OVC2_BLK13_RABR.
 */
#define OVC2_RABR13      (OVC2_BLK13_RABR)

/** \\brief  C0, Overlay Mask Register */
#define OVC2_BLK14_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FBC0u)

/** Alias (User Manual Name) for OVC2_BLK14_OMASK.
 * To use register names with standard convension, please use OVC2_BLK14_OMASK.
 */
#define OVC2_OMASK14     (OVC2_BLK14_OMASK)

/** \\brief  BC, Overlay Target Address Register */
#define OVC2_BLK14_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FBBCu)

/** Alias (User Manual Name) for OVC2_BLK14_OTAR.
 * To use register names with standard convension, please use OVC2_BLK14_OTAR.
 */
#define OVC2_OTAR14      (OVC2_BLK14_OTAR)

/** \\brief  B8, Redirected Address Base Register */
#define OVC2_BLK14_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FBB8u)

/** Alias (User Manual Name) for OVC2_BLK14_RABR.
 * To use register names with standard convension, please use OVC2_BLK14_RABR.
 */
#define OVC2_RABR14      (OVC2_BLK14_RABR)

/** \\brief  CC, Overlay Mask Register */
#define OVC2_BLK15_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FBCCu)

/** Alias (User Manual Name) for OVC2_BLK15_OMASK.
 * To use register names with standard convension, please use OVC2_BLK15_OMASK.
 */
#define OVC2_OMASK15     (OVC2_BLK15_OMASK)

/** \\brief  C8, Overlay Target Address Register */
#define OVC2_BLK15_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FBC8u)

/** Alias (User Manual Name) for OVC2_BLK15_OTAR.
 * To use register names with standard convension, please use OVC2_BLK15_OTAR.
 */
#define OVC2_OTAR15      (OVC2_BLK15_OTAR)

