Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  C4, Redirected Address Base Register */
#define OVC2_BLK15_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FBC4u)

/** Alias (User Manual Name) for OVC2_BLK15_RABR.
 * To use register names with standard convension, please use OVC2_BLK15_RABR.
 */
#define OVC2_RABR15      (OVC2_BLK15_RABR)

/** \\brief  D8, Overlay Mask Register */
#define OVC2_BLK16_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FBD8u)

/** Alias (User Manual Name) for OVC2_BLK16_OMASK.
 * To use register names with standard convension, please use OVC2_BLK16_OMASK.
 */
#define OVC2_OMASK16     (OVC2_BLK16_OMASK)

/** \\brief  D4, Overlay Target Address Register */
#define OVC2_BLK16_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FBD4u)

/** Alias (User Manual Name) for OVC2_BLK16_OTAR.
 * To use register names with standard convension, please use OVC2_BLK16_OTAR.
 */
#define OVC2_OTAR16      (OVC2_BLK16_OTAR)

/** \\brief  D0, Redirected Address Base Register */
#define OVC2_BLK16_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FBD0u)

/** Alias (User Manual Name) for OVC2_BLK16_RABR.
 * To use register names with standard convension, please use OVC2_BLK16_RABR.
 */
#define OVC2_RABR16      (OVC2_BLK16_RABR)

/** \\brief  E4, Overlay Mask Register */
#define OVC2_BLK17_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FBE4u)

/** Alias (User Manual Name) for OVC2_BLK17_OMASK.
 * To use register names with standard convension, please use OVC2_BLK17_OMASK.
 */
#define OVC2_OMASK17     (OVC2_BLK17_OMASK)

/** \\brief  E0, Overlay Target Address Register */
#define OVC2_BLK17_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FBE0u)

/** Alias (User Manual Name) for OVC2_BLK17_OTAR.
 * To use register names with standard convension, please use OVC2_BLK17_OTAR.
 */
#define OVC2_OTAR17      (OVC2_BLK17_OTAR)

/** \\brief  DC, Redirected Address Base Register */
#define OVC2_BLK17_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FBDCu)

/** Alias (User Manual Name) for OVC2_BLK17_RABR.
 * To use register names with standard convension, please use OVC2_BLK17_RABR.
 */
#define OVC2_RABR17      (OVC2_BLK17_RABR)

/** \\brief  F0, Overlay Mask Register */
#define OVC2_BLK18_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FBF0u)

/** Alias (User Manual Name) for OVC2_BLK18_OMASK.
 * To use register names with standard convension, please use OVC2_BLK18_OMASK.
 */
#define OVC2_OMASK18     (OVC2_BLK18_OMASK)

/** \\brief  EC, Overlay Target Address Register */
#define OVC2_BLK18_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FBECu)

/** Alias (User Manual Name) for OVC2_BLK18_OTAR.
 * To use register names with standard convension, please use OVC2_BLK18_OTAR.
 */
#define OVC2_OTAR18      (OVC2_BLK18_OTAR)

/** \\brief  E8, Redirected Address Base Register */
#define OVC2_BLK18_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FBE8u)

/** Alias (User Manual Name) for OVC2_BLK18_RABR.
 * To use register names with standard convension, please use OVC2_BLK18_RABR.
 */
#define OVC2_RABR18      (OVC2_BLK18_RABR)

/** \\brief  FC, Overlay Mask Register */
#define OVC2_BLK19_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FBFCu)

/** Alias (User Manual Name) for OVC2_BLK19_OMASK.
 * To use register names with standard convension, please use OVC2_BLK19_OMASK.
 */
#define OVC2_OMASK19     (OVC2_BLK19_OMASK)

/** \\brief  F8, Overlay Target Address Register */
#define OVC2_BLK19_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FBF8u)

/** Alias (User Manual Name) for OVC2_BLK19_OTAR.
 * To use register names with standard convension, please use OVC2_BLK19_OTAR.
 */
#define OVC2_OTAR19      (OVC2_BLK19_OTAR)

/** \\brief  F4, Redirected Address Base Register */
#define OVC2_BLK19_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FBF4u)

/** Alias (User Manual Name) for OVC2_BLK19_RABR.
 * To use register names with standard convension, please use OVC2_BLK19_RABR.
 */
#define OVC2_RABR19      (OVC2_BLK19_RABR)

/** \\brief  24, Overlay Mask Register */
#define OVC2_BLK1_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FB24u)

/** Alias (User Manual Name) for OVC2_BLK1_OMASK.
 * To use register names with standard convension, please use OVC2_BLK1_OMASK.
 */
#define OVC2_OMASK1      (OVC2_BLK1_OMASK)

/** \\brief  20, Overlay Target Address Register */
#define OVC2_BLK1_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FB20u)

/** Alias (User Manual Name) for OVC2_BLK1_OTAR.
 * To use register names with standard convension, please use OVC2_BLK1_OTAR.
 */
#define OVC2_OTAR1       (OVC2_BLK1_OTAR)

/** \\brief  1C, Redirected Address Base Register */
#define OVC2_BLK1_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FB1Cu)

/** Alias (User Manual Name) for OVC2_BLK1_RABR.
 * To use register names with standard convension, please use OVC2_BLK1_RABR.
 */
#define OVC2_RABR1       (OVC2_BLK1_RABR)

/** \\brief  108, Overlay Mask Register */
#define OVC2_BLK20_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FC08u)

/** Alias (User Manual Name) for OVC2_BLK20_OMASK.
 * To use register names with standard convension, please use OVC2_BLK20_OMASK.
 */
#define OVC2_OMASK20     (OVC2_BLK20_OMASK)

/** \\brief  104, Overlay Target Address Register */
#define OVC2_BLK20_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FC04u)

/** Alias (User Manual Name) for OVC2_BLK20_OTAR.
 * To use register names with standard convension, please use OVC2_BLK20_OTAR.
 */
#define OVC2_OTAR20      (OVC2_BLK20_OTAR)

/** \\brief  100, Redirected Address Base Register */
#define OVC2_BLK20_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FC00u)

/** Alias (User Manual Name) for OVC2_BLK20_RABR.
 * To use register names with standard convension, please use OVC2_BLK20_RABR.
 */
#define OVC2_RABR20      (OVC2_BLK20_RABR)

/** \\brief  114, Overlay Mask Register */
#define OVC2_BLK21_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FC14u)

/** Alias (User Manual Name) for OVC2_BLK21_OMASK.
 * To use register names with standard convension, please use OVC2_BLK21_OMASK.
 */
#define OVC2_OMASK21     (OVC2_BLK21_OMASK)

/** \\brief  110, Overlay Target Address Register */
#define OVC2_BLK21_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FC10u)

/** Alias (User Manual Name) for OVC2_BLK21_OTAR.
 * To use register names with standard convension, please use OVC2_BLK21_OTAR.
 */
#define OVC2_OTAR21      (OVC2_BLK21_OTAR)

/** \\brief  10C, Redirected Address Base Register */
#define OVC2_BLK21_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FC0Cu)

/** Alias (User Manual Name) for OVC2_BLK21_RABR.
 * To use register names with standard convension, please use OVC2_BLK21_RABR.
 */
#define OVC2_RABR21      (OVC2_BLK21_RABR)

/** \\brief  120, Overlay Mask Register */
#define OVC2_BLK22_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FC20u)

/** Alias (User Manual Name) for OVC2_BLK22_OMASK.
 * To use register names with standard convension, please use OVC2_BLK22_OMASK.
 */
#define OVC2_OMASK22     (OVC2_BLK22_OMASK)

/** \\brief  11C, Overlay Target Address Register */
#define OVC2_BLK22_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FC1Cu)

/** Alias (User Manual Name) for OVC2_BLK22_OTAR.
 * To use register names with standard convension, please use OVC2_BLK22_OTAR.
 */
#define OVC2_OTAR22      (OVC2_BLK22_OTAR)

/** \\brief  118, Redirected Address Base Register */
#define OVC2_BLK22_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FC18u)

