Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC2_BLK22_RABR.
 * To use register names with standard convension, please use OVC2_BLK22_RABR.
 */
#define OVC2_RABR22      (OVC2_BLK22_RABR)

/** \\brief  12C, Overlay Mask Register */
#define OVC2_BLK23_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FC2Cu)

/** Alias (User Manual Name) for OVC2_BLK23_OMASK.
 * To use register names with standard convension, please use OVC2_BLK23_OMASK.
 */
#define OVC2_OMASK23     (OVC2_BLK23_OMASK)

/** \\brief  128, Overlay Target Address Register */
#define OVC2_BLK23_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FC28u)

/** Alias (User Manual Name) for OVC2_BLK23_OTAR.
 * To use register names with standard convension, please use OVC2_BLK23_OTAR.
 */
#define OVC2_OTAR23      (OVC2_BLK23_OTAR)

/** \\brief  124, Redirected Address Base Register */
#define OVC2_BLK23_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FC24u)

/** Alias (User Manual Name) for OVC2_BLK23_RABR.
 * To use register names with standard convension, please use OVC2_BLK23_RABR.
 */
#define OVC2_RABR23      (OVC2_BLK23_RABR)

/** \\brief  138, Overlay Mask Register */
#define OVC2_BLK24_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FC38u)

/** Alias (User Manual Name) for OVC2_BLK24_OMASK.
 * To use register names with standard convension, please use OVC2_BLK24_OMASK.
 */
#define OVC2_OMASK24     (OVC2_BLK24_OMASK)

/** \\brief  134, Overlay Target Address Register */
#define OVC2_BLK24_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FC34u)

/** Alias (User Manual Name) for OVC2_BLK24_OTAR.
 * To use register names with standard convension, please use OVC2_BLK24_OTAR.
 */
#define OVC2_OTAR24      (OVC2_BLK24_OTAR)

/** \\brief  130, Redirected Address Base Register */
#define OVC2_BLK24_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FC30u)

/** Alias (User Manual Name) for OVC2_BLK24_RABR.
 * To use register names with standard convension, please use OVC2_BLK24_RABR.
 */
#define OVC2_RABR24      (OVC2_BLK24_RABR)

/** \\brief  144, Overlay Mask Register */
#define OVC2_BLK25_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FC44u)

/** Alias (User Manual Name) for OVC2_BLK25_OMASK.
 * To use register names with standard convension, please use OVC2_BLK25_OMASK.
 */
#define OVC2_OMASK25     (OVC2_BLK25_OMASK)

/** \\brief  140, Overlay Target Address Register */
#define OVC2_BLK25_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FC40u)

/** Alias (User Manual Name) for OVC2_BLK25_OTAR.
 * To use register names with standard convension, please use OVC2_BLK25_OTAR.
 */
#define OVC2_OTAR25      (OVC2_BLK25_OTAR)

/** \\brief  13C, Redirected Address Base Register */
#define OVC2_BLK25_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FC3Cu)

/** Alias (User Manual Name) for OVC2_BLK25_RABR.
 * To use register names with standard convension, please use OVC2_BLK25_RABR.
 */
#define OVC2_RABR25      (OVC2_BLK25_RABR)

/** \\brief  150, Overlay Mask Register */
#define OVC2_BLK26_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FC50u)

/** Alias (User Manual Name) for OVC2_BLK26_OMASK.
 * To use register names with standard convension, please use OVC2_BLK26_OMASK.
 */
#define OVC2_OMASK26     (OVC2_BLK26_OMASK)

/** \\brief  14C, Overlay Target Address Register */
#define OVC2_BLK26_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FC4Cu)

/** Alias (User Manual Name) for OVC2_BLK26_OTAR.
 * To use register names with standard convension, please use OVC2_BLK26_OTAR.
 */
#define OVC2_OTAR26      (OVC2_BLK26_OTAR)

/** \\brief  148, Redirected Address Base Register */
#define OVC2_BLK26_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FC48u)

/** Alias (User Manual Name) for OVC2_BLK26_RABR.
 * To use register names with standard convension, please use OVC2_BLK26_RABR.
 */
#define OVC2_RABR26      (OVC2_BLK26_RABR)

/** \\brief  15C, Overlay Mask Register */
#define OVC2_BLK27_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FC5Cu)

/** Alias (User Manual Name) for OVC2_BLK27_OMASK.
 * To use register names with standard convension, please use OVC2_BLK27_OMASK.
 */
#define OVC2_OMASK27     (OVC2_BLK27_OMASK)

/** \\brief  158, Overlay Target Address Register */
#define OVC2_BLK27_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FC58u)

/** Alias (User Manual Name) for OVC2_BLK27_OTAR.
 * To use register names with standard convension, please use OVC2_BLK27_OTAR.
 */
#define OVC2_OTAR27      (OVC2_BLK27_OTAR)

/** \\brief  154, Redirected Address Base Register */
#define OVC2_BLK27_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FC54u)

/** Alias (User Manual Name) for OVC2_BLK27_RABR.
 * To use register names with standard convension, please use OVC2_BLK27_RABR.
 */
#define OVC2_RABR27      (OVC2_BLK27_RABR)

/** \\brief  168, Overlay Mask Register */
#define OVC2_BLK28_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FC68u)

/** Alias (User Manual Name) for OVC2_BLK28_OMASK.
 * To use register names with standard convension, please use OVC2_BLK28_OMASK.
 */
#define OVC2_OMASK28     (OVC2_BLK28_OMASK)

/** \\brief  164, Overlay Target Address Register */
#define OVC2_BLK28_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FC64u)

/** Alias (User Manual Name) for OVC2_BLK28_OTAR.
 * To use register names with standard convension, please use OVC2_BLK28_OTAR.
 */
#define OVC2_OTAR28      (OVC2_BLK28_OTAR)

/** \\brief  160, Redirected Address Base Register */
#define OVC2_BLK28_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FC60u)

/** Alias (User Manual Name) for OVC2_BLK28_RABR.
 * To use register names with standard convension, please use OVC2_BLK28_RABR.
 */
#define OVC2_RABR28      (OVC2_BLK28_RABR)

/** \\brief  174, Overlay Mask Register */
#define OVC2_BLK29_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FC74u)

