Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC2_BLK6_OMASK.
 * To use register names with standard convension, please use OVC2_BLK6_OMASK.
 */
#define OVC2_OMASK6      (OVC2_BLK6_OMASK)

/** \\brief  5C, Overlay Target Address Register */
#define OVC2_BLK6_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FB5Cu)

/** Alias (User Manual Name) for OVC2_BLK6_OTAR.
 * To use register names with standard convension, please use OVC2_BLK6_OTAR.
 */
#define OVC2_OTAR6       (OVC2_BLK6_OTAR)

/** \\brief  58, Redirected Address Base Register */
#define OVC2_BLK6_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FB58u)

/** Alias (User Manual Name) for OVC2_BLK6_RABR.
 * To use register names with standard convension, please use OVC2_BLK6_RABR.
 */
#define OVC2_RABR6       (OVC2_BLK6_RABR)

/** \\brief  6C, Overlay Mask Register */
#define OVC2_BLK7_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FB6Cu)

/** Alias (User Manual Name) for OVC2_BLK7_OMASK.
 * To use register names with standard convension, please use OVC2_BLK7_OMASK.
 */
#define OVC2_OMASK7      (OVC2_BLK7_OMASK)

/** \\brief  68, Overlay Target Address Register */
#define OVC2_BLK7_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FB68u)

/** Alias (User Manual Name) for OVC2_BLK7_OTAR.
 * To use register names with standard convension, please use OVC2_BLK7_OTAR.
 */
#define OVC2_OTAR7       (OVC2_BLK7_OTAR)

/** \\brief  64, Redirected Address Base Register */
#define OVC2_BLK7_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FB64u)

/** Alias (User Manual Name) for OVC2_BLK7_RABR.
 * To use register names with standard convension, please use OVC2_BLK7_RABR.
 */
#define OVC2_RABR7       (OVC2_BLK7_RABR)

/** \\brief  78, Overlay Mask Register */
#define OVC2_BLK8_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FB78u)

/** Alias (User Manual Name) for OVC2_BLK8_OMASK.
 * To use register names with standard convension, please use OVC2_BLK8_OMASK.
 */
#define OVC2_OMASK8      (OVC2_BLK8_OMASK)

/** \\brief  74, Overlay Target Address Register */
#define OVC2_BLK8_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FB74u)

/** Alias (User Manual Name) for OVC2_BLK8_OTAR.
 * To use register names with standard convension, please use OVC2_BLK8_OTAR.
 */
#define OVC2_OTAR8       (OVC2_BLK8_OTAR)

/** \\brief  70, Redirected Address Base Register */
#define OVC2_BLK8_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FB70u)

/** Alias (User Manual Name) for OVC2_BLK8_RABR.
 * To use register names with standard convension, please use OVC2_BLK8_RABR.
 */
#define OVC2_RABR8       (OVC2_BLK8_RABR)

/** \\brief  84, Overlay Mask Register */
#define OVC2_BLK9_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF884FB84u)

/** Alias (User Manual Name) for OVC2_BLK9_OMASK.
 * To use register names with standard convension, please use OVC2_BLK9_OMASK.
 */
#define OVC2_OMASK9      (OVC2_BLK9_OMASK)

/** \\brief  80, Overlay Target Address Register */
#define OVC2_BLK9_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF884FB80u)

/** Alias (User Manual Name) for OVC2_BLK9_OTAR.
 * To use register names with standard convension, please use OVC2_BLK9_OTAR.
 */
#define OVC2_OTAR9       (OVC2_BLK9_OTAR)

/** \\brief  7C, Redirected Address Base Register */
#define OVC2_BLK9_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF884FB7Cu)

/** Alias (User Manual Name) for OVC2_BLK9_RABR.
 * To use register names with standard convension, please use OVC2_BLK9_RABR.
 */
#define OVC2_RABR9       (OVC2_BLK9_RABR)

/** \\brief  0, Overlay Range Select Register */
#define OVC2_OSEL        /*lint --e(923)*/ (*(volatile Ifx_OVC_OSEL *)0xF884FB00u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ovc_Cfg_Ovc3
 * \{  */

/** \\brief  18, Overlay Mask Register */
#define OVC3_BLK0_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB18u)

/** Alias (User Manual Name) for OVC3_BLK0_OMASK.
 * To use register names with standard convension, please use OVC3_BLK0_OMASK.
 */
#define OVC3_OMASK0      (OVC3_BLK0_OMASK)

/** \\brief  14, Overlay Target Address Register */
#define OVC3_BLK0_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB14u)

/** Alias (User Manual Name) for OVC3_BLK0_OTAR.
 * To use register names with standard convension, please use OVC3_BLK0_OTAR.
 */
#define OVC3_OTAR0       (OVC3_BLK0_OTAR)

/** \\brief  10, Redirected Address Base Register */
#define OVC3_BLK0_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB10u)

/** Alias (User Manual Name) for OVC3_BLK0_RABR.
 * To use register names with standard convension, please use OVC3_BLK0_RABR.
 */
#define OVC3_RABR0       (OVC3_BLK0_RABR)

/** \\brief  90, Overlay Mask Register */
#define OVC3_BLK10_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB90u)

/** Alias (User Manual Name) for OVC3_BLK10_OMASK.
 * To use register names with standard convension, please use OVC3_BLK10_OMASK.
 */
#define OVC3_OMASK10     (OVC3_BLK10_OMASK)

/** \\brief  8C, Overlay Target Address Register */
#define OVC3_BLK10_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB8Cu)

/** Alias (User Manual Name) for OVC3_BLK10_OTAR.
 * To use register names with standard convension, please use OVC3_BLK10_OTAR.
 */
#define OVC3_OTAR10      (OVC3_BLK10_OTAR)

/** \\brief  88, Redirected Address Base Register */
#define OVC3_BLK10_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB88u)

/** Alias (User Manual Name) for OVC3_BLK10_RABR.
 * To use register names with standard convension, please use OVC3_BLK10_RABR.
 */
#define OVC3_RABR10      (OVC3_BLK10_RABR)

/** \\brief  9C, Overlay Mask Register */
#define OVC3_BLK11_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB9Cu)

/** Alias (User Manual Name) for OVC3_BLK11_OMASK.
 * To use register names with standard convension, please use OVC3_BLK11_OMASK.
 */
#define OVC3_OMASK11     (OVC3_BLK11_OMASK)

/** \\brief  98, Overlay Target Address Register */
#define OVC3_BLK11_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB98u)

