Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC3_BLK11_OTAR.
 * To use register names with standard convension, please use OVC3_BLK11_OTAR.
 */
#define OVC3_OTAR11      (OVC3_BLK11_OTAR)

/** \\brief  94, Redirected Address Base Register */
#define OVC3_BLK11_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB94u)

/** Alias (User Manual Name) for OVC3_BLK11_RABR.
 * To use register names with standard convension, please use OVC3_BLK11_RABR.
 */
#define OVC3_RABR11      (OVC3_BLK11_RABR)

/** \\brief  A8, Overlay Mask Register */
#define OVC3_BLK12_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FBA8u)

/** Alias (User Manual Name) for OVC3_BLK12_OMASK.
 * To use register names with standard convension, please use OVC3_BLK12_OMASK.
 */
#define OVC3_OMASK12     (OVC3_BLK12_OMASK)

/** \\brief  A4, Overlay Target Address Register */
#define OVC3_BLK12_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FBA4u)

/** Alias (User Manual Name) for OVC3_BLK12_OTAR.
 * To use register names with standard convension, please use OVC3_BLK12_OTAR.
 */
#define OVC3_OTAR12      (OVC3_BLK12_OTAR)

/** \\brief  A0, Redirected Address Base Register */
#define OVC3_BLK12_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FBA0u)

/** Alias (User Manual Name) for OVC3_BLK12_RABR.
 * To use register names with standard convension, please use OVC3_BLK12_RABR.
 */
#define OVC3_RABR12      (OVC3_BLK12_RABR)

/** \\brief  B4, Overlay Mask Register */
#define OVC3_BLK13_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FBB4u)

/** Alias (User Manual Name) for OVC3_BLK13_OMASK.
 * To use register names with standard convension, please use OVC3_BLK13_OMASK.
 */
#define OVC3_OMASK13     (OVC3_BLK13_OMASK)

/** \\brief  B0, Overlay Target Address Register */
#define OVC3_BLK13_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FBB0u)

/** Alias (User Manual Name) for OVC3_BLK13_OTAR.
 * To use register names with standard convension, please use OVC3_BLK13_OTAR.
 */
#define OVC3_OTAR13      (OVC3_BLK13_OTAR)

/** \\brief  AC, Redirected Address Base Register */
#define OVC3_BLK13_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FBACu)

/** Alias (User Manual Name) for OVC3_BLK13_RABR.
 * To use register names with standard convension, please use OVC3_BLK13_RABR.
 */
#define OVC3_RABR13      (OVC3_BLK13_RABR)

/** \\brief  C0, Overlay Mask Register */
#define OVC3_BLK14_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FBC0u)

/** Alias (User Manual Name) for OVC3_BLK14_OMASK.
 * To use register names with standard convension, please use OVC3_BLK14_OMASK.
 */
#define OVC3_OMASK14     (OVC3_BLK14_OMASK)

/** \\brief  BC, Overlay Target Address Register */
#define OVC3_BLK14_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FBBCu)

/** Alias (User Manual Name) for OVC3_BLK14_OTAR.
 * To use register names with standard convension, please use OVC3_BLK14_OTAR.
 */
#define OVC3_OTAR14      (OVC3_BLK14_OTAR)

/** \\brief  B8, Redirected Address Base Register */
#define OVC3_BLK14_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FBB8u)

/** Alias (User Manual Name) for OVC3_BLK14_RABR.
 * To use register names with standard convension, please use OVC3_BLK14_RABR.
 */
#define OVC3_RABR14      (OVC3_BLK14_RABR)

/** \\brief  CC, Overlay Mask Register */
#define OVC3_BLK15_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FBCCu)

/** Alias (User Manual Name) for OVC3_BLK15_OMASK.
 * To use register names with standard convension, please use OVC3_BLK15_OMASK.
 */
#define OVC3_OMASK15     (OVC3_BLK15_OMASK)

/** \\brief  C8, Overlay Target Address Register */
#define OVC3_BLK15_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FBC8u)

/** Alias (User Manual Name) for OVC3_BLK15_OTAR.
 * To use register names with standard convension, please use OVC3_BLK15_OTAR.
 */
#define OVC3_OTAR15      (OVC3_BLK15_OTAR)

/** \\brief  C4, Redirected Address Base Register */
#define OVC3_BLK15_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FBC4u)

/** Alias (User Manual Name) for OVC3_BLK15_RABR.
 * To use register names with standard convension, please use OVC3_BLK15_RABR.
 */
#define OVC3_RABR15      (OVC3_BLK15_RABR)

/** \\brief  D8, Overlay Mask Register */
#define OVC3_BLK16_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FBD8u)

/** Alias (User Manual Name) for OVC3_BLK16_OMASK.
 * To use register names with standard convension, please use OVC3_BLK16_OMASK.
 */
#define OVC3_OMASK16     (OVC3_BLK16_OMASK)

/** \\brief  D4, Overlay Target Address Register */
#define OVC3_BLK16_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FBD4u)

/** Alias (User Manual Name) for OVC3_BLK16_OTAR.
 * To use register names with standard convension, please use OVC3_BLK16_OTAR.
 */
#define OVC3_OTAR16      (OVC3_BLK16_OTAR)

/** \\brief  D0, Redirected Address Base Register */
#define OVC3_BLK16_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FBD0u)

/** Alias (User Manual Name) for OVC3_BLK16_RABR.
 * To use register names with standard convension, please use OVC3_BLK16_RABR.
 */
#define OVC3_RABR16      (OVC3_BLK16_RABR)

/** \\brief  E4, Overlay Mask Register */
#define OVC3_BLK17_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FBE4u)

/** Alias (User Manual Name) for OVC3_BLK17_OMASK.
 * To use register names with standard convension, please use OVC3_BLK17_OMASK.
 */
#define OVC3_OMASK17     (OVC3_BLK17_OMASK)

/** \\brief  E0, Overlay Target Address Register */
#define OVC3_BLK17_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FBE0u)

/** Alias (User Manual Name) for OVC3_BLK17_OTAR.
 * To use register names with standard convension, please use OVC3_BLK17_OTAR.
 */
#define OVC3_OTAR17      (OVC3_BLK17_OTAR)

/** \\brief  DC, Redirected Address Base Register */
#define OVC3_BLK17_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FBDCu)

/** Alias (User Manual Name) for OVC3_BLK17_RABR.
 * To use register names with standard convension, please use OVC3_BLK17_RABR.
 */
#define OVC3_RABR17      (OVC3_BLK17_RABR)

/** \\brief  F0, Overlay Mask Register */
#define OVC3_BLK18_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FBF0u)

/** Alias (User Manual Name) for OVC3_BLK18_OMASK.
 * To use register names with standard convension, please use OVC3_BLK18_OMASK.
 */
#define OVC3_OMASK18     (OVC3_BLK18_OMASK)

/** \\brief  EC, Overlay Target Address Register */
#define OVC3_BLK18_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FBECu)

/** Alias (User Manual Name) for OVC3_BLK18_OTAR.
 * To use register names with standard convension, please use OVC3_BLK18_OTAR.
 */
#define OVC3_OTAR18      (OVC3_BLK18_OTAR)

/** \\brief  E8, Redirected Address Base Register */
#define OVC3_BLK18_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FBE8u)

