Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC3_BLK18_RABR.
 * To use register names with standard convension, please use OVC3_BLK18_RABR.
 */
#define OVC3_RABR18      (OVC3_BLK18_RABR)

/** \\brief  FC, Overlay Mask Register */
#define OVC3_BLK19_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FBFCu)

/** Alias (User Manual Name) for OVC3_BLK19_OMASK.
 * To use register names with standard convension, please use OVC3_BLK19_OMASK.
 */
#define OVC3_OMASK19     (OVC3_BLK19_OMASK)

/** \\brief  F8, Overlay Target Address Register */
#define OVC3_BLK19_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FBF8u)

/** Alias (User Manual Name) for OVC3_BLK19_OTAR.
 * To use register names with standard convension, please use OVC3_BLK19_OTAR.
 */
#define OVC3_OTAR19      (OVC3_BLK19_OTAR)

/** \\brief  F4, Redirected Address Base Register */
#define OVC3_BLK19_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FBF4u)

/** Alias (User Manual Name) for OVC3_BLK19_RABR.
 * To use register names with standard convension, please use OVC3_BLK19_RABR.
 */
#define OVC3_RABR19      (OVC3_BLK19_RABR)

/** \\brief  24, Overlay Mask Register */
#define OVC3_BLK1_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB24u)

/** Alias (User Manual Name) for OVC3_BLK1_OMASK.
 * To use register names with standard convension, please use OVC3_BLK1_OMASK.
 */
#define OVC3_OMASK1      (OVC3_BLK1_OMASK)

/** \\brief  20, Overlay Target Address Register */
#define OVC3_BLK1_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB20u)

/** Alias (User Manual Name) for OVC3_BLK1_OTAR.
 * To use register names with standard convension, please use OVC3_BLK1_OTAR.
 */
#define OVC3_OTAR1       (OVC3_BLK1_OTAR)

/** \\brief  1C, Redirected Address Base Register */
#define OVC3_BLK1_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB1Cu)

/** Alias (User Manual Name) for OVC3_BLK1_RABR.
 * To use register names with standard convension, please use OVC3_BLK1_RABR.
 */
#define OVC3_RABR1       (OVC3_BLK1_RABR)

/** \\brief  108, Overlay Mask Register */
#define OVC3_BLK20_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC08u)

/** Alias (User Manual Name) for OVC3_BLK20_OMASK.
 * To use register names with standard convension, please use OVC3_BLK20_OMASK.
 */
#define OVC3_OMASK20     (OVC3_BLK20_OMASK)

/** \\brief  104, Overlay Target Address Register */
#define OVC3_BLK20_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC04u)

/** Alias (User Manual Name) for OVC3_BLK20_OTAR.
 * To use register names with standard convension, please use OVC3_BLK20_OTAR.
 */
#define OVC3_OTAR20      (OVC3_BLK20_OTAR)

/** \\brief  100, Redirected Address Base Register */
#define OVC3_BLK20_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC00u)

/** Alias (User Manual Name) for OVC3_BLK20_RABR.
 * To use register names with standard convension, please use OVC3_BLK20_RABR.
 */
#define OVC3_RABR20      (OVC3_BLK20_RABR)

/** \\brief  114, Overlay Mask Register */
#define OVC3_BLK21_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC14u)

/** Alias (User Manual Name) for OVC3_BLK21_OMASK.
 * To use register names with standard convension, please use OVC3_BLK21_OMASK.
 */
#define OVC3_OMASK21     (OVC3_BLK21_OMASK)

/** \\brief  110, Overlay Target Address Register */
#define OVC3_BLK21_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC10u)

/** Alias (User Manual Name) for OVC3_BLK21_OTAR.
 * To use register names with standard convension, please use OVC3_BLK21_OTAR.
 */
#define OVC3_OTAR21      (OVC3_BLK21_OTAR)

/** \\brief  10C, Redirected Address Base Register */
#define OVC3_BLK21_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC0Cu)

/** Alias (User Manual Name) for OVC3_BLK21_RABR.
 * To use register names with standard convension, please use OVC3_BLK21_RABR.
 */
#define OVC3_RABR21      (OVC3_BLK21_RABR)

/** \\brief  120, Overlay Mask Register */
#define OVC3_BLK22_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC20u)

/** Alias (User Manual Name) for OVC3_BLK22_OMASK.
 * To use register names with standard convension, please use OVC3_BLK22_OMASK.
 */
#define OVC3_OMASK22     (OVC3_BLK22_OMASK)

/** \\brief  11C, Overlay Target Address Register */
#define OVC3_BLK22_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC1Cu)

/** Alias (User Manual Name) for OVC3_BLK22_OTAR.
 * To use register names with standard convension, please use OVC3_BLK22_OTAR.
 */
#define OVC3_OTAR22      (OVC3_BLK22_OTAR)

/** \\brief  118, Redirected Address Base Register */
#define OVC3_BLK22_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC18u)

/** Alias (User Manual Name) for OVC3_BLK22_RABR.
 * To use register names with standard convension, please use OVC3_BLK22_RABR.
 */
#define OVC3_RABR22      (OVC3_BLK22_RABR)

/** \\brief  12C, Overlay Mask Register */
#define OVC3_BLK23_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC2Cu)

/** Alias (User Manual Name) for OVC3_BLK23_OMASK.
 * To use register names with standard convension, please use OVC3_BLK23_OMASK.
 */
#define OVC3_OMASK23     (OVC3_BLK23_OMASK)

/** \\brief  128, Overlay Target Address Register */
#define OVC3_BLK23_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC28u)

/** Alias (User Manual Name) for OVC3_BLK23_OTAR.
 * To use register names with standard convension, please use OVC3_BLK23_OTAR.
 */
#define OVC3_OTAR23      (OVC3_BLK23_OTAR)

/** \\brief  124, Redirected Address Base Register */
#define OVC3_BLK23_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC24u)

/** Alias (User Manual Name) for OVC3_BLK23_RABR.
 * To use register names with standard convension, please use OVC3_BLK23_RABR.
 */
#define OVC3_RABR23      (OVC3_BLK23_RABR)

/** \\brief  138, Overlay Mask Register */
#define OVC3_BLK24_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC38u)

/** Alias (User Manual Name) for OVC3_BLK24_OMASK.
 * To use register names with standard convension, please use OVC3_BLK24_OMASK.
 */
#define OVC3_OMASK24     (OVC3_BLK24_OMASK)

/** \\brief  134, Overlay Target Address Register */
#define OVC3_BLK24_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC34u)

