Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC3_BLK24_OTAR.
 * To use register names with standard convension, please use OVC3_BLK24_OTAR.
 */
#define OVC3_OTAR24      (OVC3_BLK24_OTAR)

/** \\brief  130, Redirected Address Base Register */
#define OVC3_BLK24_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC30u)

/** Alias (User Manual Name) for OVC3_BLK24_RABR.
 * To use register names with standard convension, please use OVC3_BLK24_RABR.
 */
#define OVC3_RABR24      (OVC3_BLK24_RABR)

/** \\brief  144, Overlay Mask Register */
#define OVC3_BLK25_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC44u)

/** Alias (User Manual Name) for OVC3_BLK25_OMASK.
 * To use register names with standard convension, please use OVC3_BLK25_OMASK.
 */
#define OVC3_OMASK25     (OVC3_BLK25_OMASK)

/** \\brief  140, Overlay Target Address Register */
#define OVC3_BLK25_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC40u)

/** Alias (User Manual Name) for OVC3_BLK25_OTAR.
 * To use register names with standard convension, please use OVC3_BLK25_OTAR.
 */
#define OVC3_OTAR25      (OVC3_BLK25_OTAR)

/** \\brief  13C, Redirected Address Base Register */
#define OVC3_BLK25_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC3Cu)

/** Alias (User Manual Name) for OVC3_BLK25_RABR.
 * To use register names with standard convension, please use OVC3_BLK25_RABR.
 */
#define OVC3_RABR25      (OVC3_BLK25_RABR)

/** \\brief  150, Overlay Mask Register */
#define OVC3_BLK26_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC50u)

/** Alias (User Manual Name) for OVC3_BLK26_OMASK.
 * To use register names with standard convension, please use OVC3_BLK26_OMASK.
 */
#define OVC3_OMASK26     (OVC3_BLK26_OMASK)

/** \\brief  14C, Overlay Target Address Register */
#define OVC3_BLK26_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC4Cu)

/** Alias (User Manual Name) for OVC3_BLK26_OTAR.
 * To use register names with standard convension, please use OVC3_BLK26_OTAR.
 */
#define OVC3_OTAR26      (OVC3_BLK26_OTAR)

/** \\brief  148, Redirected Address Base Register */
#define OVC3_BLK26_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC48u)

/** Alias (User Manual Name) for OVC3_BLK26_RABR.
 * To use register names with standard convension, please use OVC3_BLK26_RABR.
 */
#define OVC3_RABR26      (OVC3_BLK26_RABR)

/** \\brief  15C, Overlay Mask Register */
#define OVC3_BLK27_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC5Cu)

/** Alias (User Manual Name) for OVC3_BLK27_OMASK.
 * To use register names with standard convension, please use OVC3_BLK27_OMASK.
 */
#define OVC3_OMASK27     (OVC3_BLK27_OMASK)

/** \\brief  158, Overlay Target Address Register */
#define OVC3_BLK27_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC58u)

/** Alias (User Manual Name) for OVC3_BLK27_OTAR.
 * To use register names with standard convension, please use OVC3_BLK27_OTAR.
 */
#define OVC3_OTAR27      (OVC3_BLK27_OTAR)

/** \\brief  154, Redirected Address Base Register */
#define OVC3_BLK27_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC54u)

/** Alias (User Manual Name) for OVC3_BLK27_RABR.
 * To use register names with standard convension, please use OVC3_BLK27_RABR.
 */
#define OVC3_RABR27      (OVC3_BLK27_RABR)

/** \\brief  168, Overlay Mask Register */
#define OVC3_BLK28_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC68u)

/** Alias (User Manual Name) for OVC3_BLK28_OMASK.
 * To use register names with standard convension, please use OVC3_BLK28_OMASK.
 */
#define OVC3_OMASK28     (OVC3_BLK28_OMASK)

/** \\brief  164, Overlay Target Address Register */
#define OVC3_BLK28_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC64u)

/** Alias (User Manual Name) for OVC3_BLK28_OTAR.
 * To use register names with standard convension, please use OVC3_BLK28_OTAR.
 */
#define OVC3_OTAR28      (OVC3_BLK28_OTAR)

/** \\brief  160, Redirected Address Base Register */
#define OVC3_BLK28_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC60u)

/** Alias (User Manual Name) for OVC3_BLK28_RABR.
 * To use register names with standard convension, please use OVC3_BLK28_RABR.
 */
#define OVC3_RABR28      (OVC3_BLK28_RABR)

/** \\brief  174, Overlay Mask Register */
#define OVC3_BLK29_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC74u)

/** Alias (User Manual Name) for OVC3_BLK29_OMASK.
 * To use register names with standard convension, please use OVC3_BLK29_OMASK.
 */
#define OVC3_OMASK29     (OVC3_BLK29_OMASK)

/** \\brief  170, Overlay Target Address Register */
#define OVC3_BLK29_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC70u)

/** Alias (User Manual Name) for OVC3_BLK29_OTAR.
 * To use register names with standard convension, please use OVC3_BLK29_OTAR.
 */
#define OVC3_OTAR29      (OVC3_BLK29_OTAR)

/** \\brief  16C, Redirected Address Base Register */
#define OVC3_BLK29_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC6Cu)

/** Alias (User Manual Name) for OVC3_BLK29_RABR.
 * To use register names with standard convension, please use OVC3_BLK29_RABR.
 */
#define OVC3_RABR29      (OVC3_BLK29_RABR)

/** \\brief  30, Overlay Mask Register */
#define OVC3_BLK2_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB30u)

/** Alias (User Manual Name) for OVC3_BLK2_OMASK.
 * To use register names with standard convension, please use OVC3_BLK2_OMASK.
 */
#define OVC3_OMASK2      (OVC3_BLK2_OMASK)

/** \\brief  2C, Overlay Target Address Register */
#define OVC3_BLK2_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB2Cu)

/** Alias (User Manual Name) for OVC3_BLK2_OTAR.
 * To use register names with standard convension, please use OVC3_BLK2_OTAR.
 */
#define OVC3_OTAR2       (OVC3_BLK2_OTAR)

/** \\brief  28, Redirected Address Base Register */
#define OVC3_BLK2_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB28u)

