Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC3_BLK2_RABR.
 * To use register names with standard convension, please use OVC3_BLK2_RABR.
 */
#define OVC3_RABR2       (OVC3_BLK2_RABR)

/** \\brief  180, Overlay Mask Register */
#define OVC3_BLK30_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC80u)

/** Alias (User Manual Name) for OVC3_BLK30_OMASK.
 * To use register names with standard convension, please use OVC3_BLK30_OMASK.
 */
#define OVC3_OMASK30     (OVC3_BLK30_OMASK)

/** \\brief  17C, Overlay Target Address Register */
#define OVC3_BLK30_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC7Cu)

/** Alias (User Manual Name) for OVC3_BLK30_OTAR.
 * To use register names with standard convension, please use OVC3_BLK30_OTAR.
 */
#define OVC3_OTAR30      (OVC3_BLK30_OTAR)

/** \\brief  178, Redirected Address Base Register */
#define OVC3_BLK30_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC78u)

/** Alias (User Manual Name) for OVC3_BLK30_RABR.
 * To use register names with standard convension, please use OVC3_BLK30_RABR.
 */
#define OVC3_RABR30      (OVC3_BLK30_RABR)

/** \\brief  18C, Overlay Mask Register */
#define OVC3_BLK31_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FC8Cu)

/** Alias (User Manual Name) for OVC3_BLK31_OMASK.
 * To use register names with standard convension, please use OVC3_BLK31_OMASK.
 */
#define OVC3_OMASK31     (OVC3_BLK31_OMASK)

/** \\brief  188, Overlay Target Address Register */
#define OVC3_BLK31_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FC88u)

/** Alias (User Manual Name) for OVC3_BLK31_OTAR.
 * To use register names with standard convension, please use OVC3_BLK31_OTAR.
 */
#define OVC3_OTAR31      (OVC3_BLK31_OTAR)

/** \\brief  184, Redirected Address Base Register */
#define OVC3_BLK31_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FC84u)

/** Alias (User Manual Name) for OVC3_BLK31_RABR.
 * To use register names with standard convension, please use OVC3_BLK31_RABR.
 */
#define OVC3_RABR31      (OVC3_BLK31_RABR)

/** \\brief  3C, Overlay Mask Register */
#define OVC3_BLK3_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB3Cu)

/** Alias (User Manual Name) for OVC3_BLK3_OMASK.
 * To use register names with standard convension, please use OVC3_BLK3_OMASK.
 */
#define OVC3_OMASK3      (OVC3_BLK3_OMASK)

/** \\brief  38, Overlay Target Address Register */
#define OVC3_BLK3_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB38u)

/** Alias (User Manual Name) for OVC3_BLK3_OTAR.
 * To use register names with standard convension, please use OVC3_BLK3_OTAR.
 */
#define OVC3_OTAR3       (OVC3_BLK3_OTAR)

/** \\brief  34, Redirected Address Base Register */
#define OVC3_BLK3_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB34u)

/** Alias (User Manual Name) for OVC3_BLK3_RABR.
 * To use register names with standard convension, please use OVC3_BLK3_RABR.
 */
#define OVC3_RABR3       (OVC3_BLK3_RABR)

/** \\brief  48, Overlay Mask Register */
#define OVC3_BLK4_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB48u)

/** Alias (User Manual Name) for OVC3_BLK4_OMASK.
 * To use register names with standard convension, please use OVC3_BLK4_OMASK.
 */
#define OVC3_OMASK4      (OVC3_BLK4_OMASK)

/** \\brief  44, Overlay Target Address Register */
#define OVC3_BLK4_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB44u)

/** Alias (User Manual Name) for OVC3_BLK4_OTAR.
 * To use register names with standard convension, please use OVC3_BLK4_OTAR.
 */
#define OVC3_OTAR4       (OVC3_BLK4_OTAR)

/** \\brief  40, Redirected Address Base Register */
#define OVC3_BLK4_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB40u)

/** Alias (User Manual Name) for OVC3_BLK4_RABR.
 * To use register names with standard convension, please use OVC3_BLK4_RABR.
 */
#define OVC3_RABR4       (OVC3_BLK4_RABR)

/** \\brief  54, Overlay Mask Register */
#define OVC3_BLK5_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB54u)

/** Alias (User Manual Name) for OVC3_BLK5_OMASK.
 * To use register names with standard convension, please use OVC3_BLK5_OMASK.
 */
#define OVC3_OMASK5      (OVC3_BLK5_OMASK)

/** \\brief  50, Overlay Target Address Register */
#define OVC3_BLK5_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB50u)

/** Alias (User Manual Name) for OVC3_BLK5_OTAR.
 * To use register names with standard convension, please use OVC3_BLK5_OTAR.
 */
#define OVC3_OTAR5       (OVC3_BLK5_OTAR)

/** \\brief  4C, Redirected Address Base Register */
#define OVC3_BLK5_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB4Cu)

/** Alias (User Manual Name) for OVC3_BLK5_RABR.
 * To use register names with standard convension, please use OVC3_BLK5_RABR.
 */
#define OVC3_RABR5       (OVC3_BLK5_RABR)

/** \\brief  60, Overlay Mask Register */
#define OVC3_BLK6_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB60u)

/** Alias (User Manual Name) for OVC3_BLK6_OMASK.
 * To use register names with standard convension, please use OVC3_BLK6_OMASK.
 */
#define OVC3_OMASK6      (OVC3_BLK6_OMASK)

/** \\brief  5C, Overlay Target Address Register */
#define OVC3_BLK6_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB5Cu)

/** Alias (User Manual Name) for OVC3_BLK6_OTAR.
 * To use register names with standard convension, please use OVC3_BLK6_OTAR.
 */
#define OVC3_OTAR6       (OVC3_BLK6_OTAR)

/** \\brief  58, Redirected Address Base Register */
#define OVC3_BLK6_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB58u)

/** Alias (User Manual Name) for OVC3_BLK6_RABR.
 * To use register names with standard convension, please use OVC3_BLK6_RABR.
 */
#define OVC3_RABR6       (OVC3_BLK6_RABR)

/** \\brief  6C, Overlay Mask Register */
#define OVC3_BLK7_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB6Cu)

/** Alias (User Manual Name) for OVC3_BLK7_OMASK.
 * To use register names with standard convension, please use OVC3_BLK7_OMASK.
 */
#define OVC3_OMASK7      (OVC3_BLK7_OMASK)

/** \\brief  68, Overlay Target Address Register */
#define OVC3_BLK7_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB68u)

