Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC3_BLK7_OTAR.
 * To use register names with standard convension, please use OVC3_BLK7_OTAR.
 */
#define OVC3_OTAR7       (OVC3_BLK7_OTAR)

/** \\brief  64, Redirected Address Base Register */
#define OVC3_BLK7_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB64u)

/** Alias (User Manual Name) for OVC3_BLK7_RABR.
 * To use register names with standard convension, please use OVC3_BLK7_RABR.
 */
#define OVC3_RABR7       (OVC3_BLK7_RABR)

/** \\brief  78, Overlay Mask Register */
#define OVC3_BLK8_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB78u)

/** Alias (User Manual Name) for OVC3_BLK8_OMASK.
 * To use register names with standard convension, please use OVC3_BLK8_OMASK.
 */
#define OVC3_OMASK8      (OVC3_BLK8_OMASK)

/** \\brief  74, Overlay Target Address Register */
#define OVC3_BLK8_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB74u)

/** Alias (User Manual Name) for OVC3_BLK8_OTAR.
 * To use register names with standard convension, please use OVC3_BLK8_OTAR.
 */
#define OVC3_OTAR8       (OVC3_BLK8_OTAR)

/** \\brief  70, Redirected Address Base Register */
#define OVC3_BLK8_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB70u)

/** Alias (User Manual Name) for OVC3_BLK8_RABR.
 * To use register names with standard convension, please use OVC3_BLK8_RABR.
 */
#define OVC3_RABR8       (OVC3_BLK8_RABR)

/** \\brief  84, Overlay Mask Register */
#define OVC3_BLK9_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF886FB84u)

/** Alias (User Manual Name) for OVC3_BLK9_OMASK.
 * To use register names with standard convension, please use OVC3_BLK9_OMASK.
 */
#define OVC3_OMASK9      (OVC3_BLK9_OMASK)

/** \\brief  80, Overlay Target Address Register */
#define OVC3_BLK9_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF886FB80u)

/** Alias (User Manual Name) for OVC3_BLK9_OTAR.
 * To use register names with standard convension, please use OVC3_BLK9_OTAR.
 */
#define OVC3_OTAR9       (OVC3_BLK9_OTAR)

/** \\brief  7C, Redirected Address Base Register */
#define OVC3_BLK9_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF886FB7Cu)

/** Alias (User Manual Name) for OVC3_BLK9_RABR.
 * To use register names with standard convension, please use OVC3_BLK9_RABR.
 */
#define OVC3_RABR9       (OVC3_BLK9_RABR)

/** \\brief  0, Overlay Range Select Register */
#define OVC3_OSEL        /*lint --e(923)*/ (*(volatile Ifx_OVC_OSEL *)0xF886FB00u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ovc_Cfg_Ovc4
 * \{  */

/** \\brief  18, Overlay Mask Register */
#define OVC4_BLK0_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FB18u)

/** Alias (User Manual Name) for OVC4_BLK0_OMASK.
 * To use register names with standard convension, please use OVC4_BLK0_OMASK.
 */
#define OVC4_OMASK0      (OVC4_BLK0_OMASK)

/** \\brief  14, Overlay Target Address Register */
#define OVC4_BLK0_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FB14u)

/** Alias (User Manual Name) for OVC4_BLK0_OTAR.
 * To use register names with standard convension, please use OVC4_BLK0_OTAR.
 */
#define OVC4_OTAR0       (OVC4_BLK0_OTAR)

/** \\brief  10, Redirected Address Base Register */
#define OVC4_BLK0_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FB10u)

/** Alias (User Manual Name) for OVC4_BLK0_RABR.
 * To use register names with standard convension, please use OVC4_BLK0_RABR.
 */
#define OVC4_RABR0       (OVC4_BLK0_RABR)

/** \\brief  90, Overlay Mask Register */
#define OVC4_BLK10_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FB90u)

/** Alias (User Manual Name) for OVC4_BLK10_OMASK.
 * To use register names with standard convension, please use OVC4_BLK10_OMASK.
 */
#define OVC4_OMASK10     (OVC4_BLK10_OMASK)

/** \\brief  8C, Overlay Target Address Register */
#define OVC4_BLK10_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FB8Cu)

/** Alias (User Manual Name) for OVC4_BLK10_OTAR.
 * To use register names with standard convension, please use OVC4_BLK10_OTAR.
 */
#define OVC4_OTAR10      (OVC4_BLK10_OTAR)

/** \\brief  88, Redirected Address Base Register */
#define OVC4_BLK10_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FB88u)

/** Alias (User Manual Name) for OVC4_BLK10_RABR.
 * To use register names with standard convension, please use OVC4_BLK10_RABR.
 */
#define OVC4_RABR10      (OVC4_BLK10_RABR)

/** \\brief  9C, Overlay Mask Register */
#define OVC4_BLK11_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FB9Cu)

/** Alias (User Manual Name) for OVC4_BLK11_OMASK.
 * To use register names with standard convension, please use OVC4_BLK11_OMASK.
 */
#define OVC4_OMASK11     (OVC4_BLK11_OMASK)

/** \\brief  98, Overlay Target Address Register */
#define OVC4_BLK11_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FB98u)

/** Alias (User Manual Name) for OVC4_BLK11_OTAR.
 * To use register names with standard convension, please use OVC4_BLK11_OTAR.
 */
#define OVC4_OTAR11      (OVC4_BLK11_OTAR)

/** \\brief  94, Redirected Address Base Register */
#define OVC4_BLK11_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FB94u)

/** Alias (User Manual Name) for OVC4_BLK11_RABR.
 * To use register names with standard convension, please use OVC4_BLK11_RABR.
 */
#define OVC4_RABR11      (OVC4_BLK11_RABR)

/** \\brief  A8, Overlay Mask Register */
#define OVC4_BLK12_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FBA8u)

/** Alias (User Manual Name) for OVC4_BLK12_OMASK.
 * To use register names with standard convension, please use OVC4_BLK12_OMASK.
 */
#define OVC4_OMASK12     (OVC4_BLK12_OMASK)

/** \\brief  A4, Overlay Target Address Register */
#define OVC4_BLK12_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FBA4u)

/** Alias (User Manual Name) for OVC4_BLK12_OTAR.
 * To use register names with standard convension, please use OVC4_BLK12_OTAR.
 */
#define OVC4_OTAR12      (OVC4_BLK12_OTAR)

/** \\brief  A0, Redirected Address Base Register */
#define OVC4_BLK12_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FBA0u)

/** Alias (User Manual Name) for OVC4_BLK12_RABR.
 * To use register names with standard convension, please use OVC4_BLK12_RABR.
 */
#define OVC4_RABR12      (OVC4_BLK12_RABR)

