Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  B4, Overlay Mask Register */
#define OVC4_BLK13_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FBB4u)

/** Alias (User Manual Name) for OVC4_BLK13_OMASK.
 * To use register names with standard convension, please use OVC4_BLK13_OMASK.
 */
#define OVC4_OMASK13     (OVC4_BLK13_OMASK)

/** \\brief  B0, Overlay Target Address Register */
#define OVC4_BLK13_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FBB0u)

/** Alias (User Manual Name) for OVC4_BLK13_OTAR.
 * To use register names with standard convension, please use OVC4_BLK13_OTAR.
 */
#define OVC4_OTAR13      (OVC4_BLK13_OTAR)

/** \\brief  AC, Redirected Address Base Register */
#define OVC4_BLK13_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FBACu)

/** Alias (User Manual Name) for OVC4_BLK13_RABR.
 * To use register names with standard convension, please use OVC4_BLK13_RABR.
 */
#define OVC4_RABR13      (OVC4_BLK13_RABR)

/** \\brief  C0, Overlay Mask Register */
#define OVC4_BLK14_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FBC0u)

/** Alias (User Manual Name) for OVC4_BLK14_OMASK.
 * To use register names with standard convension, please use OVC4_BLK14_OMASK.
 */
#define OVC4_OMASK14     (OVC4_BLK14_OMASK)

/** \\brief  BC, Overlay Target Address Register */
#define OVC4_BLK14_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FBBCu)

/** Alias (User Manual Name) for OVC4_BLK14_OTAR.
 * To use register names with standard convension, please use OVC4_BLK14_OTAR.
 */
#define OVC4_OTAR14      (OVC4_BLK14_OTAR)

/** \\brief  B8, Redirected Address Base Register */
#define OVC4_BLK14_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FBB8u)

/** Alias (User Manual Name) for OVC4_BLK14_RABR.
 * To use register names with standard convension, please use OVC4_BLK14_RABR.
 */
#define OVC4_RABR14      (OVC4_BLK14_RABR)

/** \\brief  CC, Overlay Mask Register */
#define OVC4_BLK15_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FBCCu)

/** Alias (User Manual Name) for OVC4_BLK15_OMASK.
 * To use register names with standard convension, please use OVC4_BLK15_OMASK.
 */
#define OVC4_OMASK15     (OVC4_BLK15_OMASK)

/** \\brief  C8, Overlay Target Address Register */
#define OVC4_BLK15_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FBC8u)

/** Alias (User Manual Name) for OVC4_BLK15_OTAR.
 * To use register names with standard convension, please use OVC4_BLK15_OTAR.
 */
#define OVC4_OTAR15      (OVC4_BLK15_OTAR)

/** \\brief  C4, Redirected Address Base Register */
#define OVC4_BLK15_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FBC4u)

/** Alias (User Manual Name) for OVC4_BLK15_RABR.
 * To use register names with standard convension, please use OVC4_BLK15_RABR.
 */
#define OVC4_RABR15      (OVC4_BLK15_RABR)

/** \\brief  D8, Overlay Mask Register */
#define OVC4_BLK16_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FBD8u)

/** Alias (User Manual Name) for OVC4_BLK16_OMASK.
 * To use register names with standard convension, please use OVC4_BLK16_OMASK.
 */
#define OVC4_OMASK16     (OVC4_BLK16_OMASK)

/** \\brief  D4, Overlay Target Address Register */
#define OVC4_BLK16_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FBD4u)

/** Alias (User Manual Name) for OVC4_BLK16_OTAR.
 * To use register names with standard convension, please use OVC4_BLK16_OTAR.
 */
#define OVC4_OTAR16      (OVC4_BLK16_OTAR)

/** \\brief  D0, Redirected Address Base Register */
#define OVC4_BLK16_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FBD0u)

/** Alias (User Manual Name) for OVC4_BLK16_RABR.
 * To use register names with standard convension, please use OVC4_BLK16_RABR.
 */
#define OVC4_RABR16      (OVC4_BLK16_RABR)

/** \\brief  E4, Overlay Mask Register */
#define OVC4_BLK17_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FBE4u)

/** Alias (User Manual Name) for OVC4_BLK17_OMASK.
 * To use register names with standard convension, please use OVC4_BLK17_OMASK.
 */
#define OVC4_OMASK17     (OVC4_BLK17_OMASK)

/** \\brief  E0, Overlay Target Address Register */
#define OVC4_BLK17_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FBE0u)

/** Alias (User Manual Name) for OVC4_BLK17_OTAR.
 * To use register names with standard convension, please use OVC4_BLK17_OTAR.
 */
#define OVC4_OTAR17      (OVC4_BLK17_OTAR)

/** \\brief  DC, Redirected Address Base Register */
#define OVC4_BLK17_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FBDCu)

/** Alias (User Manual Name) for OVC4_BLK17_RABR.
 * To use register names with standard convension, please use OVC4_BLK17_RABR.
 */
#define OVC4_RABR17      (OVC4_BLK17_RABR)

/** \\brief  F0, Overlay Mask Register */
#define OVC4_BLK18_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FBF0u)

/** Alias (User Manual Name) for OVC4_BLK18_OMASK.
 * To use register names with standard convension, please use OVC4_BLK18_OMASK.
 */
#define OVC4_OMASK18     (OVC4_BLK18_OMASK)

/** \\brief  EC, Overlay Target Address Register */
#define OVC4_BLK18_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FBECu)

/** Alias (User Manual Name) for OVC4_BLK18_OTAR.
 * To use register names with standard convension, please use OVC4_BLK18_OTAR.
 */
#define OVC4_OTAR18      (OVC4_BLK18_OTAR)

/** \\brief  E8, Redirected Address Base Register */
#define OVC4_BLK18_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FBE8u)

/** Alias (User Manual Name) for OVC4_BLK18_RABR.
 * To use register names with standard convension, please use OVC4_BLK18_RABR.
 */
#define OVC4_RABR18      (OVC4_BLK18_RABR)

/** \\brief  FC, Overlay Mask Register */
#define OVC4_BLK19_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FBFCu)

/** Alias (User Manual Name) for OVC4_BLK19_OMASK.
 * To use register names with standard convension, please use OVC4_BLK19_OMASK.
 */
#define OVC4_OMASK19     (OVC4_BLK19_OMASK)

/** \\brief  F8, Overlay Target Address Register */
#define OVC4_BLK19_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FBF8u)

/** Alias (User Manual Name) for OVC4_BLK19_OTAR.
 * To use register names with standard convension, please use OVC4_BLK19_OTAR.
 */
#define OVC4_OTAR19      (OVC4_BLK19_OTAR)

