Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  F4, Redirected Address Base Register */
#define OVC4_BLK19_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FBF4u)

/** Alias (User Manual Name) for OVC4_BLK19_RABR.
 * To use register names with standard convension, please use OVC4_BLK19_RABR.
 */
#define OVC4_RABR19      (OVC4_BLK19_RABR)

/** \\brief  24, Overlay Mask Register */
#define OVC4_BLK1_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FB24u)

/** Alias (User Manual Name) for OVC4_BLK1_OMASK.
 * To use register names with standard convension, please use OVC4_BLK1_OMASK.
 */
#define OVC4_OMASK1      (OVC4_BLK1_OMASK)

/** \\brief  20, Overlay Target Address Register */
#define OVC4_BLK1_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FB20u)

/** Alias (User Manual Name) for OVC4_BLK1_OTAR.
 * To use register names with standard convension, please use OVC4_BLK1_OTAR.
 */
#define OVC4_OTAR1       (OVC4_BLK1_OTAR)

/** \\brief  1C, Redirected Address Base Register */
#define OVC4_BLK1_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FB1Cu)

/** Alias (User Manual Name) for OVC4_BLK1_RABR.
 * To use register names with standard convension, please use OVC4_BLK1_RABR.
 */
#define OVC4_RABR1       (OVC4_BLK1_RABR)

/** \\brief  108, Overlay Mask Register */
#define OVC4_BLK20_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FC08u)

/** Alias (User Manual Name) for OVC4_BLK20_OMASK.
 * To use register names with standard convension, please use OVC4_BLK20_OMASK.
 */
#define OVC4_OMASK20     (OVC4_BLK20_OMASK)

/** \\brief  104, Overlay Target Address Register */
#define OVC4_BLK20_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FC04u)

/** Alias (User Manual Name) for OVC4_BLK20_OTAR.
 * To use register names with standard convension, please use OVC4_BLK20_OTAR.
 */
#define OVC4_OTAR20      (OVC4_BLK20_OTAR)

/** \\brief  100, Redirected Address Base Register */
#define OVC4_BLK20_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FC00u)

/** Alias (User Manual Name) for OVC4_BLK20_RABR.
 * To use register names with standard convension, please use OVC4_BLK20_RABR.
 */
#define OVC4_RABR20      (OVC4_BLK20_RABR)

/** \\brief  114, Overlay Mask Register */
#define OVC4_BLK21_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FC14u)

/** Alias (User Manual Name) for OVC4_BLK21_OMASK.
 * To use register names with standard convension, please use OVC4_BLK21_OMASK.
 */
#define OVC4_OMASK21     (OVC4_BLK21_OMASK)

/** \\brief  110, Overlay Target Address Register */
#define OVC4_BLK21_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FC10u)

/** Alias (User Manual Name) for OVC4_BLK21_OTAR.
 * To use register names with standard convension, please use OVC4_BLK21_OTAR.
 */
#define OVC4_OTAR21      (OVC4_BLK21_OTAR)

/** \\brief  10C, Redirected Address Base Register */
#define OVC4_BLK21_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FC0Cu)

/** Alias (User Manual Name) for OVC4_BLK21_RABR.
 * To use register names with standard convension, please use OVC4_BLK21_RABR.
 */
#define OVC4_RABR21      (OVC4_BLK21_RABR)

/** \\brief  120, Overlay Mask Register */
#define OVC4_BLK22_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FC20u)

/** Alias (User Manual Name) for OVC4_BLK22_OMASK.
 * To use register names with standard convension, please use OVC4_BLK22_OMASK.
 */
#define OVC4_OMASK22     (OVC4_BLK22_OMASK)

/** \\brief  11C, Overlay Target Address Register */
#define OVC4_BLK22_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FC1Cu)

/** Alias (User Manual Name) for OVC4_BLK22_OTAR.
 * To use register names with standard convension, please use OVC4_BLK22_OTAR.
 */
#define OVC4_OTAR22      (OVC4_BLK22_OTAR)

/** \\brief  118, Redirected Address Base Register */
#define OVC4_BLK22_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FC18u)

/** Alias (User Manual Name) for OVC4_BLK22_RABR.
 * To use register names with standard convension, please use OVC4_BLK22_RABR.
 */
#define OVC4_RABR22      (OVC4_BLK22_RABR)

/** \\brief  12C, Overlay Mask Register */
#define OVC4_BLK23_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FC2Cu)

/** Alias (User Manual Name) for OVC4_BLK23_OMASK.
 * To use register names with standard convension, please use OVC4_BLK23_OMASK.
 */
#define OVC4_OMASK23     (OVC4_BLK23_OMASK)

/** \\brief  128, Overlay Target Address Register */
#define OVC4_BLK23_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FC28u)

/** Alias (User Manual Name) for OVC4_BLK23_OTAR.
 * To use register names with standard convension, please use OVC4_BLK23_OTAR.
 */
#define OVC4_OTAR23      (OVC4_BLK23_OTAR)

/** \\brief  124, Redirected Address Base Register */
#define OVC4_BLK23_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FC24u)

/** Alias (User Manual Name) for OVC4_BLK23_RABR.
 * To use register names with standard convension, please use OVC4_BLK23_RABR.
 */
#define OVC4_RABR23      (OVC4_BLK23_RABR)

/** \\brief  138, Overlay Mask Register */
#define OVC4_BLK24_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FC38u)

/** Alias (User Manual Name) for OVC4_BLK24_OMASK.
 * To use register names with standard convension, please use OVC4_BLK24_OMASK.
 */
#define OVC4_OMASK24     (OVC4_BLK24_OMASK)

/** \\brief  134, Overlay Target Address Register */
#define OVC4_BLK24_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FC34u)

/** Alias (User Manual Name) for OVC4_BLK24_OTAR.
 * To use register names with standard convension, please use OVC4_BLK24_OTAR.
 */
#define OVC4_OTAR24      (OVC4_BLK24_OTAR)

/** \\brief  130, Redirected Address Base Register */
#define OVC4_BLK24_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FC30u)

/** Alias (User Manual Name) for OVC4_BLK24_RABR.
 * To use register names with standard convension, please use OVC4_BLK24_RABR.
 */
#define OVC4_RABR24      (OVC4_BLK24_RABR)

/** \\brief  144, Overlay Mask Register */
#define OVC4_BLK25_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FC44u)

/** Alias (User Manual Name) for OVC4_BLK25_OMASK.
 * To use register names with standard convension, please use OVC4_BLK25_OMASK.
 */
#define OVC4_OMASK25     (OVC4_BLK25_OMASK)

