Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC4_BLK31_OMASK.
 * To use register names with standard convension, please use OVC4_BLK31_OMASK.
 */
#define OVC4_OMASK31     (OVC4_BLK31_OMASK)

/** \\brief  188, Overlay Target Address Register */
#define OVC4_BLK31_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FC88u)

/** Alias (User Manual Name) for OVC4_BLK31_OTAR.
 * To use register names with standard convension, please use OVC4_BLK31_OTAR.
 */
#define OVC4_OTAR31      (OVC4_BLK31_OTAR)

/** \\brief  184, Redirected Address Base Register */
#define OVC4_BLK31_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FC84u)

/** Alias (User Manual Name) for OVC4_BLK31_RABR.
 * To use register names with standard convension, please use OVC4_BLK31_RABR.
 */
#define OVC4_RABR31      (OVC4_BLK31_RABR)

/** \\brief  3C, Overlay Mask Register */
#define OVC4_BLK3_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FB3Cu)

/** Alias (User Manual Name) for OVC4_BLK3_OMASK.
 * To use register names with standard convension, please use OVC4_BLK3_OMASK.
 */
#define OVC4_OMASK3      (OVC4_BLK3_OMASK)

/** \\brief  38, Overlay Target Address Register */
#define OVC4_BLK3_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FB38u)

/** Alias (User Manual Name) for OVC4_BLK3_OTAR.
 * To use register names with standard convension, please use OVC4_BLK3_OTAR.
 */
#define OVC4_OTAR3       (OVC4_BLK3_OTAR)

/** \\brief  34, Redirected Address Base Register */
#define OVC4_BLK3_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FB34u)

/** Alias (User Manual Name) for OVC4_BLK3_RABR.
 * To use register names with standard convension, please use OVC4_BLK3_RABR.
 */
#define OVC4_RABR3       (OVC4_BLK3_RABR)

/** \\brief  48, Overlay Mask Register */
#define OVC4_BLK4_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FB48u)

/** Alias (User Manual Name) for OVC4_BLK4_OMASK.
 * To use register names with standard convension, please use OVC4_BLK4_OMASK.
 */
#define OVC4_OMASK4      (OVC4_BLK4_OMASK)

/** \\brief  44, Overlay Target Address Register */
#define OVC4_BLK4_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FB44u)

/** Alias (User Manual Name) for OVC4_BLK4_OTAR.
 * To use register names with standard convension, please use OVC4_BLK4_OTAR.
 */
#define OVC4_OTAR4       (OVC4_BLK4_OTAR)

/** \\brief  40, Redirected Address Base Register */
#define OVC4_BLK4_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FB40u)

/** Alias (User Manual Name) for OVC4_BLK4_RABR.
 * To use register names with standard convension, please use OVC4_BLK4_RABR.
 */
#define OVC4_RABR4       (OVC4_BLK4_RABR)

/** \\brief  54, Overlay Mask Register */
#define OVC4_BLK5_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FB54u)

/** Alias (User Manual Name) for OVC4_BLK5_OMASK.
 * To use register names with standard convension, please use OVC4_BLK5_OMASK.
 */
#define OVC4_OMASK5      (OVC4_BLK5_OMASK)

/** \\brief  50, Overlay Target Address Register */
#define OVC4_BLK5_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FB50u)

/** Alias (User Manual Name) for OVC4_BLK5_OTAR.
 * To use register names with standard convension, please use OVC4_BLK5_OTAR.
 */
#define OVC4_OTAR5       (OVC4_BLK5_OTAR)

/** \\brief  4C, Redirected Address Base Register */
#define OVC4_BLK5_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FB4Cu)

/** Alias (User Manual Name) for OVC4_BLK5_RABR.
 * To use register names with standard convension, please use OVC4_BLK5_RABR.
 */
#define OVC4_RABR5       (OVC4_BLK5_RABR)

/** \\brief  60, Overlay Mask Register */
#define OVC4_BLK6_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FB60u)

/** Alias (User Manual Name) for OVC4_BLK6_OMASK.
 * To use register names with standard convension, please use OVC4_BLK6_OMASK.
 */
#define OVC4_OMASK6      (OVC4_BLK6_OMASK)

/** \\brief  5C, Overlay Target Address Register */
#define OVC4_BLK6_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FB5Cu)

/** Alias (User Manual Name) for OVC4_BLK6_OTAR.
 * To use register names with standard convension, please use OVC4_BLK6_OTAR.
 */
#define OVC4_OTAR6       (OVC4_BLK6_OTAR)

/** \\brief  58, Redirected Address Base Register */
#define OVC4_BLK6_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FB58u)

/** Alias (User Manual Name) for OVC4_BLK6_RABR.
 * To use register names with standard convension, please use OVC4_BLK6_RABR.
 */
#define OVC4_RABR6       (OVC4_BLK6_RABR)

/** \\brief  6C, Overlay Mask Register */
#define OVC4_BLK7_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FB6Cu)

/** Alias (User Manual Name) for OVC4_BLK7_OMASK.
 * To use register names with standard convension, please use OVC4_BLK7_OMASK.
 */
#define OVC4_OMASK7      (OVC4_BLK7_OMASK)

/** \\brief  68, Overlay Target Address Register */
#define OVC4_BLK7_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FB68u)

/** Alias (User Manual Name) for OVC4_BLK7_OTAR.
 * To use register names with standard convension, please use OVC4_BLK7_OTAR.
 */
#define OVC4_OTAR7       (OVC4_BLK7_OTAR)

/** \\brief  64, Redirected Address Base Register */
#define OVC4_BLK7_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FB64u)

/** Alias (User Manual Name) for OVC4_BLK7_RABR.
 * To use register names with standard convension, please use OVC4_BLK7_RABR.
 */
#define OVC4_RABR7       (OVC4_BLK7_RABR)

/** \\brief  78, Overlay Mask Register */
#define OVC4_BLK8_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FB78u)

/** Alias (User Manual Name) for OVC4_BLK8_OMASK.
 * To use register names with standard convension, please use OVC4_BLK8_OMASK.
 */
#define OVC4_OMASK8      (OVC4_BLK8_OMASK)

/** \\brief  74, Overlay Target Address Register */
#define OVC4_BLK8_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FB74u)

/** Alias (User Manual Name) for OVC4_BLK8_OTAR.
 * To use register names with standard convension, please use OVC4_BLK8_OTAR.
 */
#define OVC4_OTAR8       (OVC4_BLK8_OTAR)

