Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  70, Redirected Address Base Register */
#define OVC4_BLK8_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FB70u)

/** Alias (User Manual Name) for OVC4_BLK8_RABR.
 * To use register names with standard convension, please use OVC4_BLK8_RABR.
 */
#define OVC4_RABR8       (OVC4_BLK8_RABR)

/** \\brief  84, Overlay Mask Register */
#define OVC4_BLK9_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF888FB84u)

/** Alias (User Manual Name) for OVC4_BLK9_OMASK.
 * To use register names with standard convension, please use OVC4_BLK9_OMASK.
 */
#define OVC4_OMASK9      (OVC4_BLK9_OMASK)

/** \\brief  80, Overlay Target Address Register */
#define OVC4_BLK9_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF888FB80u)

/** Alias (User Manual Name) for OVC4_BLK9_OTAR.
 * To use register names with standard convension, please use OVC4_BLK9_OTAR.
 */
#define OVC4_OTAR9       (OVC4_BLK9_OTAR)

/** \\brief  7C, Redirected Address Base Register */
#define OVC4_BLK9_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF888FB7Cu)

/** Alias (User Manual Name) for OVC4_BLK9_RABR.
 * To use register names with standard convension, please use OVC4_BLK9_RABR.
 */
#define OVC4_RABR9       (OVC4_BLK9_RABR)

/** \\brief  0, Overlay Range Select Register */
#define OVC4_OSEL        /*lint --e(923)*/ (*(volatile Ifx_OVC_OSEL *)0xF888FB00u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ovc_Cfg_Ovc5
 * \{  */

/** \\brief  18, Overlay Mask Register */
#define OVC5_BLK0_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB18u)

/** Alias (User Manual Name) for OVC5_BLK0_OMASK.
 * To use register names with standard convension, please use OVC5_BLK0_OMASK.
 */
#define OVC5_OMASK0      (OVC5_BLK0_OMASK)

/** \\brief  14, Overlay Target Address Register */
#define OVC5_BLK0_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB14u)

/** Alias (User Manual Name) for OVC5_BLK0_OTAR.
 * To use register names with standard convension, please use OVC5_BLK0_OTAR.
 */
#define OVC5_OTAR0       (OVC5_BLK0_OTAR)

/** \\brief  10, Redirected Address Base Register */
#define OVC5_BLK0_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB10u)

/** Alias (User Manual Name) for OVC5_BLK0_RABR.
 * To use register names with standard convension, please use OVC5_BLK0_RABR.
 */
#define OVC5_RABR0       (OVC5_BLK0_RABR)

/** \\brief  90, Overlay Mask Register */
#define OVC5_BLK10_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB90u)

/** Alias (User Manual Name) for OVC5_BLK10_OMASK.
 * To use register names with standard convension, please use OVC5_BLK10_OMASK.
 */
#define OVC5_OMASK10     (OVC5_BLK10_OMASK)

/** \\brief  8C, Overlay Target Address Register */
#define OVC5_BLK10_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB8Cu)

/** Alias (User Manual Name) for OVC5_BLK10_OTAR.
 * To use register names with standard convension, please use OVC5_BLK10_OTAR.
 */
#define OVC5_OTAR10      (OVC5_BLK10_OTAR)

/** \\brief  88, Redirected Address Base Register */
#define OVC5_BLK10_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB88u)

/** Alias (User Manual Name) for OVC5_BLK10_RABR.
 * To use register names with standard convension, please use OVC5_BLK10_RABR.
 */
#define OVC5_RABR10      (OVC5_BLK10_RABR)

/** \\brief  9C, Overlay Mask Register */
#define OVC5_BLK11_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB9Cu)

/** Alias (User Manual Name) for OVC5_BLK11_OMASK.
 * To use register names with standard convension, please use OVC5_BLK11_OMASK.
 */
#define OVC5_OMASK11     (OVC5_BLK11_OMASK)

/** \\brief  98, Overlay Target Address Register */
#define OVC5_BLK11_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB98u)

/** Alias (User Manual Name) for OVC5_BLK11_OTAR.
 * To use register names with standard convension, please use OVC5_BLK11_OTAR.
 */
#define OVC5_OTAR11      (OVC5_BLK11_OTAR)

/** \\brief  94, Redirected Address Base Register */
#define OVC5_BLK11_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB94u)

/** Alias (User Manual Name) for OVC5_BLK11_RABR.
 * To use register names with standard convension, please use OVC5_BLK11_RABR.
 */
#define OVC5_RABR11      (OVC5_BLK11_RABR)

/** \\brief  A8, Overlay Mask Register */
#define OVC5_BLK12_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFBA8u)

/** Alias (User Manual Name) for OVC5_BLK12_OMASK.
 * To use register names with standard convension, please use OVC5_BLK12_OMASK.
 */
#define OVC5_OMASK12     (OVC5_BLK12_OMASK)

/** \\brief  A4, Overlay Target Address Register */
#define OVC5_BLK12_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFBA4u)

/** Alias (User Manual Name) for OVC5_BLK12_OTAR.
 * To use register names with standard convension, please use OVC5_BLK12_OTAR.
 */
#define OVC5_OTAR12      (OVC5_BLK12_OTAR)

/** \\brief  A0, Redirected Address Base Register */
#define OVC5_BLK12_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFBA0u)

/** Alias (User Manual Name) for OVC5_BLK12_RABR.
 * To use register names with standard convension, please use OVC5_BLK12_RABR.
 */
#define OVC5_RABR12      (OVC5_BLK12_RABR)

/** \\brief  B4, Overlay Mask Register */
#define OVC5_BLK13_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFBB4u)

/** Alias (User Manual Name) for OVC5_BLK13_OMASK.
 * To use register names with standard convension, please use OVC5_BLK13_OMASK.
 */
#define OVC5_OMASK13     (OVC5_BLK13_OMASK)

/** \\brief  B0, Overlay Target Address Register */
#define OVC5_BLK13_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFBB0u)

/** Alias (User Manual Name) for OVC5_BLK13_OTAR.
 * To use register names with standard convension, please use OVC5_BLK13_OTAR.
 */
#define OVC5_OTAR13      (OVC5_BLK13_OTAR)

/** \\brief  AC, Redirected Address Base Register */
#define OVC5_BLK13_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFBACu)

/** Alias (User Manual Name) for OVC5_BLK13_RABR.
 * To use register names with standard convension, please use OVC5_BLK13_RABR.
 */
#define OVC5_RABR13      (OVC5_BLK13_RABR)

