Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  C0, Overlay Mask Register */
#define OVC5_BLK14_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFBC0u)

/** Alias (User Manual Name) for OVC5_BLK14_OMASK.
 * To use register names with standard convension, please use OVC5_BLK14_OMASK.
 */
#define OVC5_OMASK14     (OVC5_BLK14_OMASK)

/** \\brief  BC, Overlay Target Address Register */
#define OVC5_BLK14_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFBBCu)

/** Alias (User Manual Name) for OVC5_BLK14_OTAR.
 * To use register names with standard convension, please use OVC5_BLK14_OTAR.
 */
#define OVC5_OTAR14      (OVC5_BLK14_OTAR)

/** \\brief  B8, Redirected Address Base Register */
#define OVC5_BLK14_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFBB8u)

/** Alias (User Manual Name) for OVC5_BLK14_RABR.
 * To use register names with standard convension, please use OVC5_BLK14_RABR.
 */
#define OVC5_RABR14      (OVC5_BLK14_RABR)

/** \\brief  CC, Overlay Mask Register */
#define OVC5_BLK15_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFBCCu)

/** Alias (User Manual Name) for OVC5_BLK15_OMASK.
 * To use register names with standard convension, please use OVC5_BLK15_OMASK.
 */
#define OVC5_OMASK15     (OVC5_BLK15_OMASK)

/** \\brief  C8, Overlay Target Address Register */
#define OVC5_BLK15_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFBC8u)

/** Alias (User Manual Name) for OVC5_BLK15_OTAR.
 * To use register names with standard convension, please use OVC5_BLK15_OTAR.
 */
#define OVC5_OTAR15      (OVC5_BLK15_OTAR)

/** \\brief  C4, Redirected Address Base Register */
#define OVC5_BLK15_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFBC4u)

/** Alias (User Manual Name) for OVC5_BLK15_RABR.
 * To use register names with standard convension, please use OVC5_BLK15_RABR.
 */
#define OVC5_RABR15      (OVC5_BLK15_RABR)

/** \\brief  D8, Overlay Mask Register */
#define OVC5_BLK16_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFBD8u)

/** Alias (User Manual Name) for OVC5_BLK16_OMASK.
 * To use register names with standard convension, please use OVC5_BLK16_OMASK.
 */
#define OVC5_OMASK16     (OVC5_BLK16_OMASK)

/** \\brief  D4, Overlay Target Address Register */
#define OVC5_BLK16_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFBD4u)

/** Alias (User Manual Name) for OVC5_BLK16_OTAR.
 * To use register names with standard convension, please use OVC5_BLK16_OTAR.
 */
#define OVC5_OTAR16      (OVC5_BLK16_OTAR)

/** \\brief  D0, Redirected Address Base Register */
#define OVC5_BLK16_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFBD0u)

/** Alias (User Manual Name) for OVC5_BLK16_RABR.
 * To use register names with standard convension, please use OVC5_BLK16_RABR.
 */
#define OVC5_RABR16      (OVC5_BLK16_RABR)

/** \\brief  E4, Overlay Mask Register */
#define OVC5_BLK17_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFBE4u)

/** Alias (User Manual Name) for OVC5_BLK17_OMASK.
 * To use register names with standard convension, please use OVC5_BLK17_OMASK.
 */
#define OVC5_OMASK17     (OVC5_BLK17_OMASK)

/** \\brief  E0, Overlay Target Address Register */
#define OVC5_BLK17_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFBE0u)

/** Alias (User Manual Name) for OVC5_BLK17_OTAR.
 * To use register names with standard convension, please use OVC5_BLK17_OTAR.
 */
#define OVC5_OTAR17      (OVC5_BLK17_OTAR)

/** \\brief  DC, Redirected Address Base Register */
#define OVC5_BLK17_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFBDCu)

/** Alias (User Manual Name) for OVC5_BLK17_RABR.
 * To use register names with standard convension, please use OVC5_BLK17_RABR.
 */
#define OVC5_RABR17      (OVC5_BLK17_RABR)

/** \\brief  F0, Overlay Mask Register */
#define OVC5_BLK18_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFBF0u)

/** Alias (User Manual Name) for OVC5_BLK18_OMASK.
 * To use register names with standard convension, please use OVC5_BLK18_OMASK.
 */
#define OVC5_OMASK18     (OVC5_BLK18_OMASK)

/** \\brief  EC, Overlay Target Address Register */
#define OVC5_BLK18_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFBECu)

/** Alias (User Manual Name) for OVC5_BLK18_OTAR.
 * To use register names with standard convension, please use OVC5_BLK18_OTAR.
 */
#define OVC5_OTAR18      (OVC5_BLK18_OTAR)

/** \\brief  E8, Redirected Address Base Register */
#define OVC5_BLK18_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFBE8u)

/** Alias (User Manual Name) for OVC5_BLK18_RABR.
 * To use register names with standard convension, please use OVC5_BLK18_RABR.
 */
#define OVC5_RABR18      (OVC5_BLK18_RABR)

/** \\brief  FC, Overlay Mask Register */
#define OVC5_BLK19_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFBFCu)

/** Alias (User Manual Name) for OVC5_BLK19_OMASK.
 * To use register names with standard convension, please use OVC5_BLK19_OMASK.
 */
#define OVC5_OMASK19     (OVC5_BLK19_OMASK)

/** \\brief  F8, Overlay Target Address Register */
#define OVC5_BLK19_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFBF8u)

/** Alias (User Manual Name) for OVC5_BLK19_OTAR.
 * To use register names with standard convension, please use OVC5_BLK19_OTAR.
 */
#define OVC5_OTAR19      (OVC5_BLK19_OTAR)

/** \\brief  F4, Redirected Address Base Register */
#define OVC5_BLK19_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFBF4u)

/** Alias (User Manual Name) for OVC5_BLK19_RABR.
 * To use register names with standard convension, please use OVC5_BLK19_RABR.
 */
#define OVC5_RABR19      (OVC5_BLK19_RABR)

/** \\brief  24, Overlay Mask Register */
#define OVC5_BLK1_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB24u)

/** Alias (User Manual Name) for OVC5_BLK1_OMASK.
 * To use register names with standard convension, please use OVC5_BLK1_OMASK.
 */
#define OVC5_OMASK1      (OVC5_BLK1_OMASK)

/** \\brief  20, Overlay Target Address Register */
#define OVC5_BLK1_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB20u)

/** Alias (User Manual Name) for OVC5_BLK1_OTAR.
 * To use register names with standard convension, please use OVC5_BLK1_OTAR.
 */
#define OVC5_OTAR1       (OVC5_BLK1_OTAR)

/** \\brief  1C, Redirected Address Base Register */
#define OVC5_BLK1_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB1Cu)

/** Alias (User Manual Name) for OVC5_BLK1_RABR.
 * To use register names with standard convension, please use OVC5_BLK1_RABR.
 */
#define OVC5_RABR1       (OVC5_BLK1_RABR)

/** \\brief  108, Overlay Mask Register */
#define OVC5_BLK20_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC08u)

/** Alias (User Manual Name) for OVC5_BLK20_OMASK.
 * To use register names with standard convension, please use OVC5_BLK20_OMASK.
 */
#define OVC5_OMASK20     (OVC5_BLK20_OMASK)

