Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  104, Overlay Target Address Register */
#define OVC5_BLK20_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC04u)

/** Alias (User Manual Name) for OVC5_BLK20_OTAR.
 * To use register names with standard convension, please use OVC5_BLK20_OTAR.
 */
#define OVC5_OTAR20      (OVC5_BLK20_OTAR)

/** \\brief  100, Redirected Address Base Register */
#define OVC5_BLK20_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC00u)

/** Alias (User Manual Name) for OVC5_BLK20_RABR.
 * To use register names with standard convension, please use OVC5_BLK20_RABR.
 */
#define OVC5_RABR20      (OVC5_BLK20_RABR)

/** \\brief  114, Overlay Mask Register */
#define OVC5_BLK21_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC14u)

/** Alias (User Manual Name) for OVC5_BLK21_OMASK.
 * To use register names with standard convension, please use OVC5_BLK21_OMASK.
 */
#define OVC5_OMASK21     (OVC5_BLK21_OMASK)

/** \\brief  110, Overlay Target Address Register */
#define OVC5_BLK21_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC10u)

/** Alias (User Manual Name) for OVC5_BLK21_OTAR.
 * To use register names with standard convension, please use OVC5_BLK21_OTAR.
 */
#define OVC5_OTAR21      (OVC5_BLK21_OTAR)

/** \\brief  10C, Redirected Address Base Register */
#define OVC5_BLK21_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC0Cu)

/** Alias (User Manual Name) for OVC5_BLK21_RABR.
 * To use register names with standard convension, please use OVC5_BLK21_RABR.
 */
#define OVC5_RABR21      (OVC5_BLK21_RABR)

/** \\brief  120, Overlay Mask Register */
#define OVC5_BLK22_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC20u)

/** Alias (User Manual Name) for OVC5_BLK22_OMASK.
 * To use register names with standard convension, please use OVC5_BLK22_OMASK.
 */
#define OVC5_OMASK22     (OVC5_BLK22_OMASK)

/** \\brief  11C, Overlay Target Address Register */
#define OVC5_BLK22_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC1Cu)

/** Alias (User Manual Name) for OVC5_BLK22_OTAR.
 * To use register names with standard convension, please use OVC5_BLK22_OTAR.
 */
#define OVC5_OTAR22      (OVC5_BLK22_OTAR)

/** \\brief  118, Redirected Address Base Register */
#define OVC5_BLK22_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC18u)

/** Alias (User Manual Name) for OVC5_BLK22_RABR.
 * To use register names with standard convension, please use OVC5_BLK22_RABR.
 */
#define OVC5_RABR22      (OVC5_BLK22_RABR)

/** \\brief  12C, Overlay Mask Register */
#define OVC5_BLK23_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC2Cu)

/** Alias (User Manual Name) for OVC5_BLK23_OMASK.
 * To use register names with standard convension, please use OVC5_BLK23_OMASK.
 */
#define OVC5_OMASK23     (OVC5_BLK23_OMASK)

/** \\brief  128, Overlay Target Address Register */
#define OVC5_BLK23_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC28u)

/** Alias (User Manual Name) for OVC5_BLK23_OTAR.
 * To use register names with standard convension, please use OVC5_BLK23_OTAR.
 */
#define OVC5_OTAR23      (OVC5_BLK23_OTAR)

/** \\brief  124, Redirected Address Base Register */
#define OVC5_BLK23_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC24u)

/** Alias (User Manual Name) for OVC5_BLK23_RABR.
 * To use register names with standard convension, please use OVC5_BLK23_RABR.
 */
#define OVC5_RABR23      (OVC5_BLK23_RABR)

/** \\brief  138, Overlay Mask Register */
#define OVC5_BLK24_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC38u)

/** Alias (User Manual Name) for OVC5_BLK24_OMASK.
 * To use register names with standard convension, please use OVC5_BLK24_OMASK.
 */
#define OVC5_OMASK24     (OVC5_BLK24_OMASK)

/** \\brief  134, Overlay Target Address Register */
#define OVC5_BLK24_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC34u)

/** Alias (User Manual Name) for OVC5_BLK24_OTAR.
 * To use register names with standard convension, please use OVC5_BLK24_OTAR.
 */
#define OVC5_OTAR24      (OVC5_BLK24_OTAR)

/** \\brief  130, Redirected Address Base Register */
#define OVC5_BLK24_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC30u)

/** Alias (User Manual Name) for OVC5_BLK24_RABR.
 * To use register names with standard convension, please use OVC5_BLK24_RABR.
 */
#define OVC5_RABR24      (OVC5_BLK24_RABR)

/** \\brief  144, Overlay Mask Register */
#define OVC5_BLK25_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC44u)

/** Alias (User Manual Name) for OVC5_BLK25_OMASK.
 * To use register names with standard convension, please use OVC5_BLK25_OMASK.
 */
#define OVC5_OMASK25     (OVC5_BLK25_OMASK)

/** \\brief  140, Overlay Target Address Register */
#define OVC5_BLK25_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC40u)

/** Alias (User Manual Name) for OVC5_BLK25_OTAR.
 * To use register names with standard convension, please use OVC5_BLK25_OTAR.
 */
#define OVC5_OTAR25      (OVC5_BLK25_OTAR)

/** \\brief  13C, Redirected Address Base Register */
#define OVC5_BLK25_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC3Cu)

/** Alias (User Manual Name) for OVC5_BLK25_RABR.
 * To use register names with standard convension, please use OVC5_BLK25_RABR.
 */
#define OVC5_RABR25      (OVC5_BLK25_RABR)

/** \\brief  150, Overlay Mask Register */
#define OVC5_BLK26_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC50u)

/** Alias (User Manual Name) for OVC5_BLK26_OMASK.
 * To use register names with standard convension, please use OVC5_BLK26_OMASK.
 */
#define OVC5_OMASK26     (OVC5_BLK26_OMASK)

/** \\brief  14C, Overlay Target Address Register */
#define OVC5_BLK26_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC4Cu)

/** Alias (User Manual Name) for OVC5_BLK26_OTAR.
 * To use register names with standard convension, please use OVC5_BLK26_OTAR.
 */
#define OVC5_OTAR26      (OVC5_BLK26_OTAR)

/** \\brief  148, Redirected Address Base Register */
#define OVC5_BLK26_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC48u)

/** Alias (User Manual Name) for OVC5_BLK26_RABR.
 * To use register names with standard convension, please use OVC5_BLK26_RABR.
 */
#define OVC5_RABR26      (OVC5_BLK26_RABR)

