Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** \\brief  15C, Overlay Mask Register */
#define OVC5_BLK27_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC5Cu)

/** Alias (User Manual Name) for OVC5_BLK27_OMASK.
 * To use register names with standard convension, please use OVC5_BLK27_OMASK.
 */
#define OVC5_OMASK27     (OVC5_BLK27_OMASK)

/** \\brief  158, Overlay Target Address Register */
#define OVC5_BLK27_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC58u)

/** Alias (User Manual Name) for OVC5_BLK27_OTAR.
 * To use register names with standard convension, please use OVC5_BLK27_OTAR.
 */
#define OVC5_OTAR27      (OVC5_BLK27_OTAR)

/** \\brief  154, Redirected Address Base Register */
#define OVC5_BLK27_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC54u)

/** Alias (User Manual Name) for OVC5_BLK27_RABR.
 * To use register names with standard convension, please use OVC5_BLK27_RABR.
 */
#define OVC5_RABR27      (OVC5_BLK27_RABR)

/** \\brief  168, Overlay Mask Register */
#define OVC5_BLK28_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC68u)

/** Alias (User Manual Name) for OVC5_BLK28_OMASK.
 * To use register names with standard convension, please use OVC5_BLK28_OMASK.
 */
#define OVC5_OMASK28     (OVC5_BLK28_OMASK)

/** \\brief  164, Overlay Target Address Register */
#define OVC5_BLK28_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC64u)

/** Alias (User Manual Name) for OVC5_BLK28_OTAR.
 * To use register names with standard convension, please use OVC5_BLK28_OTAR.
 */
#define OVC5_OTAR28      (OVC5_BLK28_OTAR)

/** \\brief  160, Redirected Address Base Register */
#define OVC5_BLK28_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC60u)

/** Alias (User Manual Name) for OVC5_BLK28_RABR.
 * To use register names with standard convension, please use OVC5_BLK28_RABR.
 */
#define OVC5_RABR28      (OVC5_BLK28_RABR)

/** \\brief  174, Overlay Mask Register */
#define OVC5_BLK29_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC74u)

/** Alias (User Manual Name) for OVC5_BLK29_OMASK.
 * To use register names with standard convension, please use OVC5_BLK29_OMASK.
 */
#define OVC5_OMASK29     (OVC5_BLK29_OMASK)

/** \\brief  170, Overlay Target Address Register */
#define OVC5_BLK29_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC70u)

/** Alias (User Manual Name) for OVC5_BLK29_OTAR.
 * To use register names with standard convension, please use OVC5_BLK29_OTAR.
 */
#define OVC5_OTAR29      (OVC5_BLK29_OTAR)

/** \\brief  16C, Redirected Address Base Register */
#define OVC5_BLK29_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC6Cu)

/** Alias (User Manual Name) for OVC5_BLK29_RABR.
 * To use register names with standard convension, please use OVC5_BLK29_RABR.
 */
#define OVC5_RABR29      (OVC5_BLK29_RABR)

/** \\brief  30, Overlay Mask Register */
#define OVC5_BLK2_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB30u)

/** Alias (User Manual Name) for OVC5_BLK2_OMASK.
 * To use register names with standard convension, please use OVC5_BLK2_OMASK.
 */
#define OVC5_OMASK2      (OVC5_BLK2_OMASK)

/** \\brief  2C, Overlay Target Address Register */
#define OVC5_BLK2_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB2Cu)

/** Alias (User Manual Name) for OVC5_BLK2_OTAR.
 * To use register names with standard convension, please use OVC5_BLK2_OTAR.
 */
#define OVC5_OTAR2       (OVC5_BLK2_OTAR)

/** \\brief  28, Redirected Address Base Register */
#define OVC5_BLK2_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB28u)

/** Alias (User Manual Name) for OVC5_BLK2_RABR.
 * To use register names with standard convension, please use OVC5_BLK2_RABR.
 */
#define OVC5_RABR2       (OVC5_BLK2_RABR)

/** \\brief  180, Overlay Mask Register */
#define OVC5_BLK30_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC80u)

/** Alias (User Manual Name) for OVC5_BLK30_OMASK.
 * To use register names with standard convension, please use OVC5_BLK30_OMASK.
 */
#define OVC5_OMASK30     (OVC5_BLK30_OMASK)

/** \\brief  17C, Overlay Target Address Register */
#define OVC5_BLK30_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC7Cu)

/** Alias (User Manual Name) for OVC5_BLK30_OTAR.
 * To use register names with standard convension, please use OVC5_BLK30_OTAR.
 */
#define OVC5_OTAR30      (OVC5_BLK30_OTAR)

/** \\brief  178, Redirected Address Base Register */
#define OVC5_BLK30_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC78u)

/** Alias (User Manual Name) for OVC5_BLK30_RABR.
 * To use register names with standard convension, please use OVC5_BLK30_RABR.
 */
#define OVC5_RABR30      (OVC5_BLK30_RABR)

/** \\brief  18C, Overlay Mask Register */
#define OVC5_BLK31_OMASK /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFC8Cu)

/** Alias (User Manual Name) for OVC5_BLK31_OMASK.
 * To use register names with standard convension, please use OVC5_BLK31_OMASK.
 */
#define OVC5_OMASK31     (OVC5_BLK31_OMASK)

/** \\brief  188, Overlay Target Address Register */
#define OVC5_BLK31_OTAR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFC88u)

/** Alias (User Manual Name) for OVC5_BLK31_OTAR.
 * To use register names with standard convension, please use OVC5_BLK31_OTAR.
 */
#define OVC5_OTAR31      (OVC5_BLK31_OTAR)

/** \\brief  184, Redirected Address Base Register */
#define OVC5_BLK31_RABR  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFC84u)

/** Alias (User Manual Name) for OVC5_BLK31_RABR.
 * To use register names with standard convension, please use OVC5_BLK31_RABR.
 */
#define OVC5_RABR31      (OVC5_BLK31_RABR)

/** \\brief  3C, Overlay Mask Register */
#define OVC5_BLK3_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB3Cu)

/** Alias (User Manual Name) for OVC5_BLK3_OMASK.
 * To use register names with standard convension, please use OVC5_BLK3_OMASK.
 */
#define OVC5_OMASK3      (OVC5_BLK3_OMASK)

/** \\brief  38, Overlay Target Address Register */
#define OVC5_BLK3_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB38u)

/** Alias (User Manual Name) for OVC5_BLK3_OTAR.
 * To use register names with standard convension, please use OVC5_BLK3_OTAR.
 */
#define OVC5_OTAR3       (OVC5_BLK3_OTAR)

/** \\brief  34, Redirected Address Base Register */
#define OVC5_BLK3_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB34u)

