Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxOvc_reg.h
/** Alias (User Manual Name) for OVC5_BLK3_RABR.
 * To use register names with standard convension, please use OVC5_BLK3_RABR.
 */
#define OVC5_RABR3       (OVC5_BLK3_RABR)

/** \\brief  48, Overlay Mask Register */
#define OVC5_BLK4_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB48u)

/** Alias (User Manual Name) for OVC5_BLK4_OMASK.
 * To use register names with standard convension, please use OVC5_BLK4_OMASK.
 */
#define OVC5_OMASK4      (OVC5_BLK4_OMASK)

/** \\brief  44, Overlay Target Address Register */
#define OVC5_BLK4_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB44u)

/** Alias (User Manual Name) for OVC5_BLK4_OTAR.
 * To use register names with standard convension, please use OVC5_BLK4_OTAR.
 */
#define OVC5_OTAR4       (OVC5_BLK4_OTAR)

/** \\brief  40, Redirected Address Base Register */
#define OVC5_BLK4_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB40u)

/** Alias (User Manual Name) for OVC5_BLK4_RABR.
 * To use register names with standard convension, please use OVC5_BLK4_RABR.
 */
#define OVC5_RABR4       (OVC5_BLK4_RABR)

/** \\brief  54, Overlay Mask Register */
#define OVC5_BLK5_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB54u)

/** Alias (User Manual Name) for OVC5_BLK5_OMASK.
 * To use register names with standard convension, please use OVC5_BLK5_OMASK.
 */
#define OVC5_OMASK5      (OVC5_BLK5_OMASK)

/** \\brief  50, Overlay Target Address Register */
#define OVC5_BLK5_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB50u)

/** Alias (User Manual Name) for OVC5_BLK5_OTAR.
 * To use register names with standard convension, please use OVC5_BLK5_OTAR.
 */
#define OVC5_OTAR5       (OVC5_BLK5_OTAR)

/** \\brief  4C, Redirected Address Base Register */
#define OVC5_BLK5_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB4Cu)

/** Alias (User Manual Name) for OVC5_BLK5_RABR.
 * To use register names with standard convension, please use OVC5_BLK5_RABR.
 */
#define OVC5_RABR5       (OVC5_BLK5_RABR)

/** \\brief  60, Overlay Mask Register */
#define OVC5_BLK6_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB60u)

/** Alias (User Manual Name) for OVC5_BLK6_OMASK.
 * To use register names with standard convension, please use OVC5_BLK6_OMASK.
 */
#define OVC5_OMASK6      (OVC5_BLK6_OMASK)

/** \\brief  5C, Overlay Target Address Register */
#define OVC5_BLK6_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB5Cu)

/** Alias (User Manual Name) for OVC5_BLK6_OTAR.
 * To use register names with standard convension, please use OVC5_BLK6_OTAR.
 */
#define OVC5_OTAR6       (OVC5_BLK6_OTAR)

/** \\brief  58, Redirected Address Base Register */
#define OVC5_BLK6_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB58u)

/** Alias (User Manual Name) for OVC5_BLK6_RABR.
 * To use register names with standard convension, please use OVC5_BLK6_RABR.
 */
#define OVC5_RABR6       (OVC5_BLK6_RABR)

/** \\brief  6C, Overlay Mask Register */
#define OVC5_BLK7_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB6Cu)

/** Alias (User Manual Name) for OVC5_BLK7_OMASK.
 * To use register names with standard convension, please use OVC5_BLK7_OMASK.
 */
#define OVC5_OMASK7      (OVC5_BLK7_OMASK)

/** \\brief  68, Overlay Target Address Register */
#define OVC5_BLK7_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB68u)

/** Alias (User Manual Name) for OVC5_BLK7_OTAR.
 * To use register names with standard convension, please use OVC5_BLK7_OTAR.
 */
#define OVC5_OTAR7       (OVC5_BLK7_OTAR)

/** \\brief  64, Redirected Address Base Register */
#define OVC5_BLK7_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB64u)

/** Alias (User Manual Name) for OVC5_BLK7_RABR.
 * To use register names with standard convension, please use OVC5_BLK7_RABR.
 */
#define OVC5_RABR7       (OVC5_BLK7_RABR)

/** \\brief  78, Overlay Mask Register */
#define OVC5_BLK8_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB78u)

/** Alias (User Manual Name) for OVC5_BLK8_OMASK.
 * To use register names with standard convension, please use OVC5_BLK8_OMASK.
 */
#define OVC5_OMASK8      (OVC5_BLK8_OMASK)

/** \\brief  74, Overlay Target Address Register */
#define OVC5_BLK8_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB74u)

/** Alias (User Manual Name) for OVC5_BLK8_OTAR.
 * To use register names with standard convension, please use OVC5_BLK8_OTAR.
 */
#define OVC5_OTAR8       (OVC5_BLK8_OTAR)

/** \\brief  70, Redirected Address Base Register */
#define OVC5_BLK8_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB70u)

/** Alias (User Manual Name) for OVC5_BLK8_RABR.
 * To use register names with standard convension, please use OVC5_BLK8_RABR.
 */
#define OVC5_RABR8       (OVC5_BLK8_RABR)

/** \\brief  84, Overlay Mask Register */
#define OVC5_BLK9_OMASK  /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OMASK *)0xF88CFB84u)

/** Alias (User Manual Name) for OVC5_BLK9_OMASK.
 * To use register names with standard convension, please use OVC5_BLK9_OMASK.
 */
#define OVC5_OMASK9      (OVC5_BLK9_OMASK)

/** \\brief  80, Overlay Target Address Register */
#define OVC5_BLK9_OTAR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_OTAR *)0xF88CFB80u)

/** Alias (User Manual Name) for OVC5_BLK9_OTAR.
 * To use register names with standard convension, please use OVC5_BLK9_OTAR.
 */
#define OVC5_OTAR9       (OVC5_BLK9_OTAR)

/** \\brief  7C, Redirected Address Base Register */
#define OVC5_BLK9_RABR   /*lint --e(923)*/ (*(volatile Ifx_OVC_BLK_RABR *)0xF88CFB7Cu)

/** Alias (User Manual Name) for OVC5_BLK9_RABR.
 * To use register names with standard convension, please use OVC5_BLK9_RABR.
 */
#define OVC5_RABR9       (OVC5_BLK9_RABR)

/** \\brief  0, Overlay Range Select Register */
#define OVC5_OSEL        /*lint --e(923)*/ (*(volatile Ifx_OVC_OSEL *)0xF88CFB00u)
/** \}  */
/******************************************************************************/

#endif /* IFXOVC_REG_H */
